pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                  File 'pic18_checkingAndBuildIPIC.cpp'                    *
//             Generated by version version GALGAS_BETA_VERSION              *
//                     february 2nd, 2011, at 16h59'39"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "version_libpm.h"
#if CURRENT_LIBPM_VERSION != VERSION_OF_LIBPM_USED_BY_GALGAS_COMPILER
  #error "This file has been compiled with a version of GALGAS that uses libpm version VERSION_OF_LIBPM_USED_BY_GALGAS_COMPILER, different than the current version (CURRENT_LIBPM_VERSION) of libpm"
#endif

//---------------------------------------------------------------------------*

#include "pic18_checkingAndBuildIPIC.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_CLI_Options.h"

//---------------------------------------------------------------------------*

#include "piccolo_options.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_checkingAndBuildIPIC.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'handleInstructionList'                      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_handleInstructionList (const GALGAS_instructionList constinArgument_inInstructionList,
                                    const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                    const GALGAS_routineMap constinArgument_inRoutineMap,
                                    const GALGAS_registerTable constinArgument_inRegisterTable,
                                    const GALGAS_constantMap constinArgument_inConstantMap,
                                    GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                    GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                    GALGAS_string & ioArgument_ioListFileContents,
                                    GALGAS_uint & ioArgument_ioCurrentBank,
                                    const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                    GALGAS_bool & outArgument_outContinuesInSequence,
                                    const GALGAS_routineKind constinArgument_inRoutineKind,
                                    C_Compiler * inCompiler
                                    COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outContinuesInSequence.drop () ; // Release 'out' argument
  //-------- @assignmentInstructionForGeneration
  outArgument_outContinuesInSequence = GALGAS_bool (true) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_instructionList enumerator_1462 (constinArgument_inInstructionList, true) ;
  //--- simple foreach instruction
  while (enumerator_1462.hasCurrentObject ()) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_0 = outArgument_outContinuesInSequence.operator_not (SOURCE_FILE_AT_LINE (44)).boolEnum () ;
    if (kBoolTrue == test_0) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (enumerator_1462.current_mInstruction (HERE).reader_mInstructionLocation (SOURCE_FILE_AT_LINE (45)), GALGAS_string ("Unreachable code") COMMA_SOURCE_FILE_AT_LINE (45)) ;
      //-------- @assignmentInstructionForGeneration
      outArgument_outContinuesInSequence = GALGAS_bool (true) ;
    }
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionList ((const cPtr_piccolo_5F_instruction *) enumerator_1462.current_mInstruction (HERE).ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, ioArgument_ioCurrentBank, constinArgument_inShouldPreserveBSR, outArgument_outContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (48)) ;
    //-------- END @methodCallInstructionForGeneration
    enumerator_1462.gotoNextObject () ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'build_ipic18_assembly_instruction_list'              *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_build_5F_ipic_31__38__5F_assembly_5F_instruction_5F_list (const GALGAS_programKind constinArgument_inProgramKind,
                                                                       const GALGAS_sint constinArgument_inROMSize,
                                                                       const GALGAS_routineDeclarationList constinArgument_inBootloaderRoutineDeclarationListForBootloaderImplementation,
                                                                       const GALGAS_routineDeclarationList constinArgument_inUserRoutineDeclarationListForBootloaderImplementation,
                                                                       const GALGAS_luint constinArgument_inBootloaderReservedROMsize,
                                                                       const GALGAS_routineDeclarationList constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation,
                                                                       const GALGAS_routineDeclarationList constinArgument_inUserRoutineDeclarationListForUserProgramImplementation,
                                                                       const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                       const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                       const GALGAS_piccoloModel constinArgument_inPiccoloModel,
                                                                       const GALGAS_bool constinArgument_inHasHighInterrupt,
                                                                       const GALGAS_bool constinArgument_inHasLowInterrupt,
                                                                       GALGAS_ipic_31__38__5F_instructionList & outArgument_outGeneratedInstructionList,
                                                                       GALGAS_string & ioArgument_ioListFileContents,
                                                                       C_Compiler * inCompiler
                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outGeneratedInstructionList.drop () ; // Release 'out' argument
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_generationOptimizationMessages = GALGAS_string::makeEmptyString () ;
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_routineMap var_routineMap = GALGAS_routineMap::constructor_emptyMap (SOURCE_FILE_AT_LINE (1829)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_61587 (constinArgument_inUserRoutineDeclarationListForBootloaderImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_61587.hasCurrentObject ()) {
    { //-------- @modifierCallInstructionForGeneration
    var_routineMap.modifier_insertKey (enumerator_61587.current_mRoutineName (HERE), enumerator_61587.current_mIsNoReturn (HERE), enumerator_61587.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1831)), enumerator_61587.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1831)), enumerator_61587.current_mPreservesBank (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (1831)) ;
    } //-------- END @typeMethodInstructionForGeneration
    enumerator_61587.gotoNextObject () ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_61797 (constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_61797.hasCurrentObject ()) {
    { //-------- @modifierCallInstructionForGeneration
    var_routineMap.modifier_insertKey (enumerator_61797.current_mRoutineName (HERE), enumerator_61797.current_mIsNoReturn (HERE), enumerator_61797.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1834)), enumerator_61797.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1834)), enumerator_61797.current_mPreservesBank (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (1834)) ;
    } //-------- END @typeMethodInstructionForGeneration
    enumerator_61797.gotoNextObject () ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDefinitionList enumerator_61984 (constinArgument_inPiccoloModel.reader_mRoutineDefinitionList (SOURCE_FILE_AT_LINE (1836)), true) ;
  //--- simple foreach instruction
  while (enumerator_61984.hasCurrentObject ()) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, enumerator_61984.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1837)).objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1837)))).operator_and (GALGAS_bool (kIsStrictSup, enumerator_61984.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1837)).objectCompare (GALGAS_uint ((PMUInt32) 15U))) COMMA_SOURCE_FILE_AT_LINE (1837)).boolEnum () ;
    if (kBoolTrue == test_0) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_1 (enumerator_61984.current_mRequiredBank (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_1, GALGAS_string ("the required bank value should be lower or equal to 15") COMMA_SOURCE_FILE_AT_LINE (1838)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_2 = GALGAS_bool (kIsNotEqual, enumerator_61984.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1840)).objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1840)))).operator_and (GALGAS_bool (kIsStrictSup, enumerator_61984.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1840)).objectCompare (GALGAS_uint ((PMUInt32) 15U))) COMMA_SOURCE_FILE_AT_LINE (1840)).boolEnum () ;
    if (kBoolTrue == test_2) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_3 (enumerator_61984.current_mReturnedBank (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_3, GALGAS_string ("the returned bank value should be lower or equal to 15") COMMA_SOURCE_FILE_AT_LINE (1841)) ;
    }
    { //-------- @modifierCallInstructionForGeneration
    var_routineMap.modifier_insertKey (enumerator_61984.current_mRoutineName (HERE), enumerator_61984.current_mIsNoReturn (HERE), enumerator_61984.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1843)), enumerator_61984.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1843)), enumerator_61984.current_mPreservesBank (HERE), inCompiler COMMA_SOURCE_FILE_AT_LINE (1843)) ;
    } //-------- END @typeMethodInstructionForGeneration
    enumerator_61984.gotoNextObject () ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_62697 (constinArgument_inBootloaderRoutineDeclarationListForBootloaderImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_62697.hasCurrentObject ()) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_4 = var_routineMap.reader_hasKey (enumerator_62697.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1848)) COMMA_SOURCE_FILE_AT_LINE (1848)).boolEnum () ;
    if (kBoolTrue == test_4) {
      //-------- @localVariableDeclarationForGeneration
      GALGAS_bool var_isNoReturn ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_requiredBank ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_returnedBank ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_bool var_preservesBank ;
      //-------- @methodCallInstructionForGeneration
      var_routineMap.method_searchKey (enumerator_62697.current_mRoutineName (HERE), var_isNoReturn, var_requiredBank, var_returnedBank, var_preservesBank, inCompiler COMMA_SOURCE_FILE_AT_LINE (1853)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_5 = GALGAS_bool (kIsNotEqual, var_isNoReturn.objectCompare (enumerator_62697.current_mIsNoReturn (HERE))).operator_or (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (enumerator_62697.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1854)))) COMMA_SOURCE_FILE_AT_LINE (1854)).operator_or (GALGAS_bool (kIsNotEqual, var_returnedBank.objectCompare (enumerator_62697.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1854)))) COMMA_SOURCE_FILE_AT_LINE (1854)).operator_or (GALGAS_bool (kIsNotEqual, var_preservesBank.objectCompare (enumerator_62697.current_mPreservesBank (HERE))) COMMA_SOURCE_FILE_AT_LINE (1854)).boolEnum () ;
      if (kBoolTrue == test_5) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (var_routineMap.reader_locationForKey (enumerator_62697.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1855)), inCompiler COMMA_SOURCE_FILE_AT_LINE (1855)), GALGAS_string ("the '").operator_concat (enumerator_62697.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1855)) COMMA_SOURCE_FILE_AT_LINE (1855)).operator_concat (GALGAS_string ("' routine header does not conform to its declaration in bootloader specification") COMMA_SOURCE_FILE_AT_LINE (1855)) COMMA_SOURCE_FILE_AT_LINE (1855)) ;
      }
    }else if (kBoolFalse == test_4) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("The bootloader specification requires the implementation to define the '").operator_concat (enumerator_62697.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1858)) COMMA_SOURCE_FILE_AT_LINE (1858)).operator_concat (GALGAS_string ("' routine") COMMA_SOURCE_FILE_AT_LINE (1858)) COMMA_SOURCE_FILE_AT_LINE (1858)) ;
    }
    enumerator_62697.gotoNextObject () ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_63690 (constinArgument_inUserRoutineDeclarationListForUserProgramImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_63690.hasCurrentObject ()) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_6 = var_routineMap.reader_hasKey (enumerator_63690.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1864)) COMMA_SOURCE_FILE_AT_LINE (1864)).boolEnum () ;
    if (kBoolTrue == test_6) {
      //-------- @localVariableDeclarationForGeneration
      GALGAS_bool var_isNoReturn ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_requiredBank ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_returnedBank ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_bool var_preservesBank ;
      //-------- @methodCallInstructionForGeneration
      var_routineMap.method_searchKey (enumerator_63690.current_mRoutineName (HERE), var_isNoReturn, var_requiredBank, var_returnedBank, var_preservesBank, inCompiler COMMA_SOURCE_FILE_AT_LINE (1869)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_7 = GALGAS_bool (kIsNotEqual, var_isNoReturn.objectCompare (enumerator_63690.current_mIsNoReturn (HERE))).operator_or (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (enumerator_63690.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1870)))) COMMA_SOURCE_FILE_AT_LINE (1870)).operator_or (GALGAS_bool (kIsNotEqual, var_returnedBank.objectCompare (enumerator_63690.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (1870)))) COMMA_SOURCE_FILE_AT_LINE (1870)).operator_or (GALGAS_bool (kIsNotEqual, var_preservesBank.objectCompare (enumerator_63690.current_mPreservesBank (HERE))) COMMA_SOURCE_FILE_AT_LINE (1870)).boolEnum () ;
      if (kBoolTrue == test_7) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (var_routineMap.reader_locationForKey (enumerator_63690.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1871)), inCompiler COMMA_SOURCE_FILE_AT_LINE (1871)), GALGAS_string ("the '").operator_concat (enumerator_63690.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1871)) COMMA_SOURCE_FILE_AT_LINE (1871)).operator_concat (GALGAS_string ("' routine header does not conform to its declaration in bootloader specification") COMMA_SOURCE_FILE_AT_LINE (1871)) COMMA_SOURCE_FILE_AT_LINE (1871)) ;
      }
    }else if (kBoolFalse == test_6) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("The bootloader specification requires the implementation to define the '").operator_concat (enumerator_63690.current_mRoutineName (HERE).reader_string (SOURCE_FILE_AT_LINE (1874)) COMMA_SOURCE_FILE_AT_LINE (1874)).operator_concat (GALGAS_string ("' routine") COMMA_SOURCE_FILE_AT_LINE (1874)) COMMA_SOURCE_FILE_AT_LINE (1874)) ;
    }
    enumerator_63690.gotoNextObject () ;
  }
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_constantMap var_constantMap = GALGAS_constantMap::constructor_emptyMap (SOURCE_FILE_AT_LINE (1878)) ;
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_lstring var_romSizeString = GALGAS_lstring::constructor_new (GALGAS_string ("ROM_SIZE"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1880)) ;
  { //-------- @modifierCallInstructionForGeneration
  var_constantMap.modifier_insertKey (var_romSizeString, constinArgument_inROMSize, inCompiler COMMA_SOURCE_FILE_AT_LINE (1881)) ;
  } //-------- END @typeMethodInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_8 = GALGAS_bool (kIsNotEqual, constinArgument_inProgramKind.objectCompare (GALGAS_programKind::constructor_regularProgram (SOURCE_FILE_AT_LINE (1883)))).boolEnum () ;
  if (kBoolTrue == test_8) {
    //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
    GALGAS_lstring var_bootloaderSizeString = GALGAS_lstring::constructor_new (GALGAS_string ("BOOTLOADER_SIZE"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1884)) ;
    { //-------- @modifierCallInstructionForGeneration
    var_constantMap.modifier_insertKey (var_bootloaderSizeString, constinArgument_inBootloaderReservedROMsize.reader_uint (SOURCE_FILE_AT_LINE (1885)).reader_sint (inCompiler COMMA_SOURCE_FILE_AT_LINE (1885)), inCompiler COMMA_SOURCE_FILE_AT_LINE (1885)) ;
    } //-------- END @typeMethodInstructionForGeneration
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_constantDefinitionList enumerator_65045 (constinArgument_inPiccoloModel.reader_mConstantDefinitionList (SOURCE_FILE_AT_LINE (1888)), true) ;
  //--- simple foreach instruction
  while (enumerator_65045.hasCurrentObject ()) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_sint var_result ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_eval ((const cPtr_immediatExpression *) enumerator_65045.current_mExpression (HERE).ptr (), constinArgument_inRegisterTable, var_constantMap, var_result, inCompiler COMMA_SOURCE_FILE_AT_LINE (1889)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_9 = constinArgument_inRegisterTable.reader_hasKey (enumerator_65045.current_mConstantName (HERE).reader_string (SOURCE_FILE_AT_LINE (1890)) COMMA_SOURCE_FILE_AT_LINE (1890)).boolEnum () ;
    if (kBoolTrue == test_9) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_10 (enumerator_65045.current_mConstantName (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_10, GALGAS_string ("'").operator_concat (enumerator_65045.current_mConstantName (HERE).reader_string (SOURCE_FILE_AT_LINE (1891)) COMMA_SOURCE_FILE_AT_LINE (1891)).operator_concat (GALGAS_string ("' is already declared as ram register or special register") COMMA_SOURCE_FILE_AT_LINE (1891)) COMMA_SOURCE_FILE_AT_LINE (1891)) ;
    }else if (kBoolFalse == test_9) {
      { //-------- @modifierCallInstructionForGeneration
      var_constantMap.modifier_insertKey (enumerator_65045.current_mConstantName (HERE), var_result, inCompiler COMMA_SOURCE_FILE_AT_LINE (1893)) ;
      } //-------- END @typeMethodInstructionForGeneration
    }
    enumerator_65045.gotoNextObject () ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_11 = GALGAS_bool (gOption_piccolo_5F_options_ouputListingFile.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_11) {
    { //-------- @routineCallInstructionForGeneration
    routine_print_5F_constant_5F_definition (var_constantMap, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1898)) ;
    } //-------- @routineCallInstructionForGeneration
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_12 = GALGAS_bool (kIsNotEqual, constinArgument_inProgramKind.objectCompare (GALGAS_programKind::constructor_userProgram (SOURCE_FILE_AT_LINE (1904)))).boolEnum () ;
  if (kBoolTrue == test_12) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_13 = var_routineMap.reader_hasKey (GALGAS_string ("main") COMMA_SOURCE_FILE_AT_LINE (1905)).boolEnum () ;
    if (kBoolTrue == test_13) {
      //-------- @localVariableDeclarationForGeneration
      GALGAS_bool var_isNoReturn ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_requiredBank ;
      //-------- @methodCallInstructionForGeneration
      GALGAS_uint joker_65898_0 ; // Joker input parameter
      GALGAS_bool joker_65901_0 ; // Joker input parameter
      var_routineMap.method_searchKey (GALGAS_lstring::constructor_new (GALGAS_string ("main"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1908)), var_isNoReturn, var_requiredBank, joker_65898_0, joker_65901_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1908)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_14 = var_isNoReturn.operator_not (SOURCE_FILE_AT_LINE (1909)).boolEnum () ;
      if (kBoolTrue == test_14) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("the \"main\" should be declared with \"noreturn\" qualifier: \"noreturn main requiresbank 0\"") COMMA_SOURCE_FILE_AT_LINE (1910)) ;
      }
