pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_15 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
      if (kBoolTrue == test_15) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (inCompiler->here (), GALGAS_string ("the \"main\" should be declared with \"requiresbank 0\" qualifier: \"noreturn main requiresbank 0\"") COMMA_SOURCE_FILE_AT_LINE (1913)) ;
      }
    }else if (kBoolFalse == test_13) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (constinArgument_inPiccoloModel.reader_mEndOfProgram (SOURCE_FILE_AT_LINE (1916)), GALGAS_string ("the program should declare the \"main\" routine") COMMA_SOURCE_FILE_AT_LINE (1916)) ;
    }
  }
  //-------- @assignmentInstructionForGeneration
  outArgument_outGeneratedInstructionList = GALGAS_ipic_31__38__5F_instructionList::constructor_emptyList (SOURCE_FILE_AT_LINE (1920)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_entryPoint = GALGAS_uint ((PMUInt32) 4U) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_66625 (constinArgument_inBootloaderRoutineDeclarationListForUserProgramImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_66625.hasCurrentObject ()) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (var_entryPoint COMMA_SOURCE_FILE_AT_LINE (1923)) COMMA_SOURCE_FILE_AT_LINE (1923)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (enumerator_66625.current_mRoutineName (HERE) COMMA_SOURCE_FILE_AT_LINE (1924)) COMMA_SOURCE_FILE_AT_LINE (1924)) ;
    //-------- @assignmentInstructionForGeneration
    var_entryPoint = var_entryPoint.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1925)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_16 = GALGAS_bool (kIsEqual, var_entryPoint.objectCompare (GALGAS_uint ((PMUInt32) 8U))).boolEnum () ;
    if (kBoolTrue == test_16) {
      //-------- @assignmentInstructionForGeneration
      var_entryPoint = GALGAS_uint ((PMUInt32) 12U) ;
    }else if (kBoolFalse == test_16) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_17 = GALGAS_bool (kIsEqual, var_entryPoint.objectCompare (GALGAS_uint ((PMUInt32) 24U))).boolEnum () ;
      if (kBoolTrue == test_17) {
        //-------- @assignmentInstructionForGeneration
        var_entryPoint = GALGAS_uint ((PMUInt32) 28U) ;
      }
    }
    enumerator_66625.gotoNextObject () ;
  }
  //-------- @assignmentInstructionForGeneration
  var_entryPoint = constinArgument_inBootloaderReservedROMsize.reader_uint (SOURCE_FILE_AT_LINE (1933)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_67167 (constinArgument_inUserRoutineDeclarationListForUserProgramImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_67167.hasCurrentObject ()) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (var_entryPoint COMMA_SOURCE_FILE_AT_LINE (1935)) COMMA_SOURCE_FILE_AT_LINE (1935)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), enumerator_67167.current_mRoutineName (HERE), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1936)) COMMA_SOURCE_FILE_AT_LINE (1936)) COMMA_SOURCE_FILE_AT_LINE (1936)) ;
    //-------- @assignmentInstructionForGeneration
    var_entryPoint = var_entryPoint.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1937)) ;
    enumerator_67167.gotoNextObject () ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_18 = GALGAS_bool (kIsNotEqual, constinArgument_inProgramKind.objectCompare (GALGAS_programKind::constructor_userProgram (SOURCE_FILE_AT_LINE (1940)))).boolEnum () ;
  if (kBoolTrue == test_18) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (GALGAS_uint ((PMUInt32) 0U) COMMA_SOURCE_FILE_AT_LINE (1941)) COMMA_SOURCE_FILE_AT_LINE (1941)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), GALGAS_lstring::constructor_new (GALGAS_string ("main"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1942)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1942)) COMMA_SOURCE_FILE_AT_LINE (1942)) COMMA_SOURCE_FILE_AT_LINE (1942)) ;
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_routineDeclarationList var_tempBootloaderRoutineDeclarationList = constinArgument_inBootloaderRoutineDeclarationListForBootloaderImplementation ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_19 = GALGAS_bool (kIsStrictSup, var_tempBootloaderRoutineDeclarationList.reader_length (SOURCE_FILE_AT_LINE (1946)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
  if (kBoolTrue == test_19) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (GALGAS_uint ((PMUInt32) 4U) COMMA_SOURCE_FILE_AT_LINE (1947)) COMMA_SOURCE_FILE_AT_LINE (1947)) ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_lstring var_routineName ;
    { //-------- @modifierCallInstructionForGeneration
    GALGAS_luint joker_68183_0 ; // Joker input parameter
    GALGAS_luint joker_68186_0 ; // Joker input parameter
    GALGAS_bool joker_68189_0 ; // Joker input parameter
    GALGAS_bool joker_68192_0 ; // Joker input parameter
    var_tempBootloaderRoutineDeclarationList.modifier_popFirst (var_routineName, joker_68183_0, joker_68186_0, joker_68189_0, joker_68192_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1949)) ;
    } //-------- END @typeMethodInstructionForGeneration
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), var_routineName, GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1950)) COMMA_SOURCE_FILE_AT_LINE (1950)) COMMA_SOURCE_FILE_AT_LINE (1950)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_20 = constinArgument_inHasHighInterrupt.boolEnum () ;
  if (kBoolTrue == test_20) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (GALGAS_uint ((PMUInt32) 8U) COMMA_SOURCE_FILE_AT_LINE (1954)) COMMA_SOURCE_FILE_AT_LINE (1954)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), GALGAS_lstring::constructor_new (GALGAS_string ("_high_interrupt"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1955)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1955)) COMMA_SOURCE_FILE_AT_LINE (1955)) COMMA_SOURCE_FILE_AT_LINE (1955)) ;
  }
  //-------- @assignmentInstructionForGeneration
  var_entryPoint = GALGAS_uint ((PMUInt32) 12U) ;
  //-------- @loopInstructionForGeneration
  if (var_tempBootloaderRoutineDeclarationList.reader_length (SOURCE_FILE_AT_LINE (1959)).isValid ()) {
    PMUInt32 variant_68819 = var_tempBootloaderRoutineDeclarationList.reader_length (SOURCE_FILE_AT_LINE (1959)).uintValue () ;
    bool loop_68819 = true ;
    while (loop_68819) {
      loop_68819 = GALGAS_bool (kIsStrictSup, var_tempBootloaderRoutineDeclarationList.reader_length (SOURCE_FILE_AT_LINE (1960)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).operator_and (GALGAS_bool (kIsStrictInf, var_entryPoint.objectCompare (GALGAS_uint ((PMUInt32) 24U))) COMMA_SOURCE_FILE_AT_LINE (1960)).isValid () ;
      if (loop_68819) {
        loop_68819 = GALGAS_bool (kIsStrictSup, var_tempBootloaderRoutineDeclarationList.reader_length (SOURCE_FILE_AT_LINE (1960)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).operator_and (GALGAS_bool (kIsStrictInf, var_entryPoint.objectCompare (GALGAS_uint ((PMUInt32) 24U))) COMMA_SOURCE_FILE_AT_LINE (1960)).boolValue () ;
      }
      if (loop_68819 && (0 == variant_68819)) {
        loop_68819 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (1959)) ;
      }
      if (loop_68819) {
        variant_68819 -- ;
        //-------- @addAssignInstructionForGeneration
        outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (var_entryPoint COMMA_SOURCE_FILE_AT_LINE (1962)) COMMA_SOURCE_FILE_AT_LINE (1962)) ;
        //-------- @localVariableDeclarationForGeneration
        GALGAS_lstring var_routineName ;
        { //-------- @modifierCallInstructionForGeneration
        GALGAS_luint joker_69122_0 ; // Joker input parameter
        GALGAS_luint joker_69125_0 ; // Joker input parameter
        GALGAS_bool joker_69128_0 ; // Joker input parameter
        GALGAS_bool joker_69131_0 ; // Joker input parameter
        var_tempBootloaderRoutineDeclarationList.modifier_popFirst (var_routineName, joker_69122_0, joker_69125_0, joker_69128_0, joker_69131_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1964)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @addAssignInstructionForGeneration
        outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), var_routineName, GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1965)) COMMA_SOURCE_FILE_AT_LINE (1965)) COMMA_SOURCE_FILE_AT_LINE (1965)) ;
        //-------- @assignmentInstructionForGeneration
        var_entryPoint = var_entryPoint.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1966)) ;
      }
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_21 = constinArgument_inHasLowInterrupt.boolEnum () ;
  if (kBoolTrue == test_21) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (GALGAS_uint ((PMUInt32) 24U) COMMA_SOURCE_FILE_AT_LINE (1970)) COMMA_SOURCE_FILE_AT_LINE (1970)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), GALGAS_lstring::constructor_new (GALGAS_string ("_low_interrupt"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1971)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1971)) COMMA_SOURCE_FILE_AT_LINE (1971)) COMMA_SOURCE_FILE_AT_LINE (1971)) ;
  }
  //-------- @assignmentInstructionForGeneration
  var_entryPoint = GALGAS_uint ((PMUInt32) 28U) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_69776 (var_tempBootloaderRoutineDeclarationList, true) ;
  //--- simple foreach instruction
  while (enumerator_69776.hasCurrentObject ()) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (var_entryPoint COMMA_SOURCE_FILE_AT_LINE (1976)) COMMA_SOURCE_FILE_AT_LINE (1976)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), enumerator_69776.current_mRoutineName (HERE), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1977)) COMMA_SOURCE_FILE_AT_LINE (1977)) COMMA_SOURCE_FILE_AT_LINE (1977)) ;
    //-------- @assignmentInstructionForGeneration
    var_entryPoint = var_entryPoint.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (1978)) ;
    enumerator_69776.gotoNextObject () ;
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_localLabelIndex = GALGAS_uint ((PMUInt32) 0U) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_22 = constinArgument_inHasLowInterrupt.boolEnum () ;
  if (kBoolTrue == test_22) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("_low_interrupt"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (1983)) COMMA_SOURCE_FILE_AT_LINE (1983)) COMMA_SOURCE_FILE_AT_LINE (1983)) ;
    //-------- @foreachInstructionForGeneration
    cEnumerator_interruptDefinitionList enumerator_70307 (constinArgument_inPiccoloModel.reader_mInterruptDefinitionList (SOURCE_FILE_AT_LINE (1984)), true) ;
    //--- simple foreach instruction
    while (enumerator_70307.hasCurrentObject ()) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_23 = GALGAS_bool (kIsEqual, enumerator_70307.current_mInterruptName (HERE).reader_string (SOURCE_FILE_AT_LINE (1985)).objectCompare (GALGAS_string ("low"))).boolEnum () ;
      if (kBoolTrue == test_23) {
        //-------- @localVariableDeclarationForGeneration
        GALGAS_bool var_continuesInSequence ;
        //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
        GALGAS_uint var_currentBank = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1987)) ;
        { //-------- @routineCallInstructionForGeneration
        routine_handleInstructionList (enumerator_70307.current_mInstructionList (HERE), constinArgument_inAccessBankSplitOffset, var_routineMap, constinArgument_inRegisterTable, var_constantMap, var_localLabelIndex, outArgument_outGeneratedInstructionList, var_generationOptimizationMessages, var_currentBank, enumerator_70307.current_mFastReturn (HERE).operator_not (SOURCE_FILE_AT_LINE (1998)), var_continuesInSequence, GALGAS_routineKind::constructor_interruptRoutine (SOURCE_FILE_AT_LINE (2000)), inCompiler COMMA_SOURCE_FILE_AT_LINE (1988)) ;
        } //-------- @routineCallInstructionForGeneration
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_24 = var_continuesInSequence.operator_not (SOURCE_FILE_AT_LINE (2002)).boolEnum () ;
        if (kBoolTrue == test_24) {
          //-------- @errorInstructionForGeneration
          inCompiler->emitSemanticError (enumerator_70307.current_mEndOfInterruptLocation (HERE), GALGAS_string ("execution cannot reach the end of the interrupt routine") COMMA_SOURCE_FILE_AT_LINE (2003)) ;
        }
        //-------- @addAssignInstructionForGeneration
        outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RETFIE::constructor_new (inCompiler->here (), enumerator_70307.current_mFastReturn (HERE) COMMA_SOURCE_FILE_AT_LINE (2006)) COMMA_SOURCE_FILE_AT_LINE (2006)) ;
      }
      enumerator_70307.gotoNextObject () ;
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_25 = constinArgument_inHasHighInterrupt.boolEnum () ;
  if (kBoolTrue == test_25) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("_high_interrupt"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2012)) COMMA_SOURCE_FILE_AT_LINE (2012)) COMMA_SOURCE_FILE_AT_LINE (2012)) ;
    //-------- @foreachInstructionForGeneration
    cEnumerator_interruptDefinitionList enumerator_71474 (constinArgument_inPiccoloModel.reader_mInterruptDefinitionList (SOURCE_FILE_AT_LINE (2013)), true) ;
    //--- simple foreach instruction
    while (enumerator_71474.hasCurrentObject ()) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_26 = GALGAS_bool (kIsEqual, enumerator_71474.current_mInterruptName (HERE).reader_string (SOURCE_FILE_AT_LINE (2014)).objectCompare (GALGAS_string ("high"))).boolEnum () ;
      if (kBoolTrue == test_26) {
        //-------- @localVariableDeclarationForGeneration
        GALGAS_bool var_continuesInSequence ;
        //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
        GALGAS_uint var_currentBank = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (2016)) ;
        { //-------- @routineCallInstructionForGeneration
        routine_handleInstructionList (enumerator_71474.current_mInstructionList (HERE), constinArgument_inAccessBankSplitOffset, var_routineMap, constinArgument_inRegisterTable, var_constantMap, var_localLabelIndex, outArgument_outGeneratedInstructionList, var_generationOptimizationMessages, var_currentBank, enumerator_71474.current_mFastReturn (HERE).operator_not (SOURCE_FILE_AT_LINE (2027)), var_continuesInSequence, GALGAS_routineKind::constructor_interruptRoutine (SOURCE_FILE_AT_LINE (2029)), inCompiler COMMA_SOURCE_FILE_AT_LINE (2017)) ;
        } //-------- @routineCallInstructionForGeneration
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_27 = var_continuesInSequence.operator_not (SOURCE_FILE_AT_LINE (2031)).boolEnum () ;
        if (kBoolTrue == test_27) {
          //-------- @errorInstructionForGeneration
          inCompiler->emitSemanticError (enumerator_71474.current_mEndOfInterruptLocation (HERE), GALGAS_string ("execution cannot reach the end of the interrupt routine") COMMA_SOURCE_FILE_AT_LINE (2032)) ;
        }
        //-------- @addAssignInstructionForGeneration
        outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RETFIE::constructor_new (inCompiler->here (), GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (2035)) COMMA_SOURCE_FILE_AT_LINE (2035)) ;
      }
      enumerator_71474.gotoNextObject () ;
    }
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDefinitionList enumerator_72483 (constinArgument_inPiccoloModel.reader_mRoutineDefinitionList (SOURCE_FILE_AT_LINE (2040)), true) ;
  //--- simple foreach instruction
  while (enumerator_72483.hasCurrentObject ()) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_continuesInSequence ;
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_uint var_currentBank = enumerator_72483.current_mRequiredBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (2042)) ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_routineKind var_routineKind ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_28 = enumerator_72483.current_mIsNoReturn (HERE).boolEnum () ;
    if (kBoolTrue == test_28) {
      //-------- @assignmentInstructionForGeneration
      var_routineKind = GALGAS_routineKind::constructor_noReturnRoutine (SOURCE_FILE_AT_LINE (2045)) ;
    }else if (kBoolFalse == test_28) {
      //-------- @assignmentInstructionForGeneration
      var_routineKind = GALGAS_routineKind::constructor_regularRoutine (SOURCE_FILE_AT_LINE (2047)) ;
    }
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (enumerator_72483.current_mRoutineName (HERE) COMMA_SOURCE_FILE_AT_LINE (2049)) COMMA_SOURCE_FILE_AT_LINE (2049)) ;
    { //-------- @routineCallInstructionForGeneration
    routine_handleInstructionList (enumerator_72483.current_mInstructionList (HERE), constinArgument_inAccessBankSplitOffset, var_routineMap, constinArgument_inRegisterTable, var_constantMap, var_localLabelIndex, outArgument_outGeneratedInstructionList, var_generationOptimizationMessages, var_currentBank, enumerator_72483.current_mPreservesBank (HERE), var_continuesInSequence, var_routineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (2050)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_29 = enumerator_72483.current_mIsNoReturn (HERE).operator_not (SOURCE_FILE_AT_LINE (2064)).operator_and (GALGAS_bool (kIsNotEqual, enumerator_72483.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (2064)).objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (2064)))) COMMA_SOURCE_FILE_AT_LINE (2064)).operator_and (GALGAS_bool (kIsNotEqual, var_currentBank.objectCompare (enumerator_72483.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (2064)))) COMMA_SOURCE_FILE_AT_LINE (2064)).boolEnum () ;
    if (kBoolTrue == test_29) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_30 (enumerator_72483.current_mRoutineName (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_30, GALGAS_string ("execution will not set BSR to ").operator_concat (enumerator_72483.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (2065)).reader_string (SOURCE_FILE_AT_LINE (2065)) COMMA_SOURCE_FILE_AT_LINE (2065)) COMMA_SOURCE_FILE_AT_LINE (2065)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_31 = enumerator_72483.current_mIsNoReturn (HERE).operator_and (var_continuesInSequence COMMA_SOURCE_FILE_AT_LINE (2067)).boolEnum () ;
    if (kBoolTrue == test_31) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_32 (enumerator_72483.current_mRoutineName (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_32, GALGAS_string ("execution should not reach the end of a \"noreturn\" routine") COMMA_SOURCE_FILE_AT_LINE (2068)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_33 = enumerator_72483.current_mIsNoReturn (HERE).operator_not (SOURCE_FILE_AT_LINE (2071)).boolEnum () ;
    if (kBoolTrue == test_33) {
      //-------- @addAssignInstructionForGeneration
      outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RETURN::constructor_new (enumerator_72483.current_mRoutineName (HERE).reader_location (SOURCE_FILE_AT_LINE (2072)) COMMA_SOURCE_FILE_AT_LINE (2072)) COMMA_SOURCE_FILE_AT_LINE (2072)) ;
    }
    enumerator_72483.gotoNextObject () ;
  }
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_registerExpression var_WREGregister = GALGAS_registerExpression::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("WREG"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2077)), GALGAS_luint::constructor_new (GALGAS_uint ((PMUInt32) 0U), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2077)) COMMA_SOURCE_FILE_AT_LINE (2077)) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_WREG_5F_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_74162_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) var_WREGregister.ptr (), constinArgument_inAccessBankSplitOffset, GALGAS_uint ((PMUInt32) 0U), constinArgument_inRegisterTable, var_WREG_5F_IPICregisterDescription, joker_74162_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (2079)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
