pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
  GALGAS_registerExpression var_TOSLregister = GALGAS_registerExpression::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("TOSL"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2087)), GALGAS_luint::constructor_new (GALGAS_uint ((PMUInt32) 0U), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2087)) COMMA_SOURCE_FILE_AT_LINE (2087)) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_TOSL_5F_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_74499_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) var_TOSLregister.ptr (), constinArgument_inAccessBankSplitOffset, GALGAS_uint ((PMUInt32) 0U), constinArgument_inRegisterTable, var_TOSL_5F_IPICregisterDescription, joker_74499_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (2089)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_registerExpression var_TOSHregister = GALGAS_registerExpression::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("TOSH"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2097)), GALGAS_luint::constructor_new (GALGAS_uint ((PMUInt32) 0U), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2097)) COMMA_SOURCE_FILE_AT_LINE (2097)) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_TOSH_5F_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_74836_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) var_TOSHregister.ptr (), constinArgument_inAccessBankSplitOffset, GALGAS_uint ((PMUInt32) 0U), constinArgument_inRegisterTable, var_TOSH_5F_IPICregisterDescription, joker_74836_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (2099)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_registerExpression var_TOSUregister = GALGAS_registerExpression::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("TOSU"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2107)), GALGAS_luint::constructor_new (GALGAS_uint ((PMUInt32) 0U), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2107)) COMMA_SOURCE_FILE_AT_LINE (2107)) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_TOSU_5F_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_75173_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) var_TOSUregister.ptr (), constinArgument_inAccessBankSplitOffset, GALGAS_uint ((PMUInt32) 0U), constinArgument_inRegisterTable, var_TOSU_5F_IPICregisterDescription, joker_75173_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (2109)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_34 = constinArgument_inPiccoloModel.reader_mNeedsComputedGoto_34_ (SOURCE_FILE_AT_LINE (2117)).boolEnum () ;
  if (kBoolTrue == test_34) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_4"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2118)) COMMA_SOURCE_FILE_AT_LINE (2118)) COMMA_SOURCE_FILE_AT_LINE (2118)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (inCompiler->here (), GALGAS_instruction_5F_FDA_5F_base_5F_code::constructor_ADDWF (SOURCE_FILE_AT_LINE (2121)), var_WREG_5F_IPICregisterDescription, GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (2119)) COMMA_SOURCE_FILE_AT_LINE (2119)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_35 = constinArgument_inPiccoloModel.reader_mNeedsComputedGoto_32_ (SOURCE_FILE_AT_LINE (2126)).boolEnum () ;
  if (kBoolTrue == test_35) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (GALGAS_string ("_computed_goto_2"), inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2127)) COMMA_SOURCE_FILE_AT_LINE (2127)) COMMA_SOURCE_FILE_AT_LINE (2127)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_36 = constinArgument_inPiccoloModel.reader_mNeedsComputedGoto_32_ (SOURCE_FILE_AT_LINE (2129)).operator_or (constinArgument_inPiccoloModel.reader_mNeedsComputedGoto_34_ (SOURCE_FILE_AT_LINE (2129)) COMMA_SOURCE_FILE_AT_LINE (2129)).boolEnum () ;
  if (kBoolTrue == test_36) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (inCompiler->here (), GALGAS_instruction_5F_FDA_5F_base_5F_code::constructor_ADDWF (SOURCE_FILE_AT_LINE (2132)), var_WREG_5F_IPICregisterDescription, GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (2130)) COMMA_SOURCE_FILE_AT_LINE (2130)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (inCompiler->here (), GALGAS_instruction_5F_FDA_5F_base_5F_code::constructor_ADDWF (SOURCE_FILE_AT_LINE (2138)), var_TOSL_5F_IPICregisterDescription, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (2136)) COMMA_SOURCE_FILE_AT_LINE (2136)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_literalOperation::constructor_new (inCompiler->here (), GALGAS_literal_5F_instruction_5F_opcode::constructor_MOVLW (SOURCE_FILE_AT_LINE (2144)), GALGAS_uint ((PMUInt32) 0U) COMMA_SOURCE_FILE_AT_LINE (2142)) COMMA_SOURCE_FILE_AT_LINE (2142)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (inCompiler->here (), GALGAS_instruction_5F_FDA_5F_base_5F_code::constructor_ADDWFC (SOURCE_FILE_AT_LINE (2149)), var_TOSH_5F_IPICregisterDescription, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (2147)) COMMA_SOURCE_FILE_AT_LINE (2147)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (inCompiler->here (), GALGAS_instruction_5F_FDA_5F_base_5F_code::constructor_ADDWFC (SOURCE_FILE_AT_LINE (2155)), var_TOSU_5F_IPICregisterDescription, GALGAS_bool (false) COMMA_SOURCE_FILE_AT_LINE (2153)) COMMA_SOURCE_FILE_AT_LINE (2153)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RETURN::constructor_new (inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2159)) COMMA_SOURCE_FILE_AT_LINE (2159)) ;
  }
  //-------- @assignmentInstructionForGeneration
  var_entryPoint = constinArgument_inBootloaderReservedROMsize.reader_uint (SOURCE_FILE_AT_LINE (2164)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_routineDeclarationList enumerator_77047 (constinArgument_inUserRoutineDeclarationListForBootloaderImplementation, true) ;
  //--- simple foreach instruction
  while (enumerator_77047.hasCurrentObject ()) {
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_ORG::constructor_new (var_entryPoint COMMA_SOURCE_FILE_AT_LINE (2166)) COMMA_SOURCE_FILE_AT_LINE (2166)) ;
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (enumerator_77047.current_mRoutineName (HERE) COMMA_SOURCE_FILE_AT_LINE (2167)) COMMA_SOURCE_FILE_AT_LINE (2167)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_37 = enumerator_77047.current_mIsNoReturn (HERE).boolEnum () ;
    if (kBoolTrue == test_37) {
      //-------- @addAssignInstructionForGeneration
      outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (inCompiler->here (), enumerator_77047.current_mRoutineName (HERE), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (2169)) COMMA_SOURCE_FILE_AT_LINE (2169)) COMMA_SOURCE_FILE_AT_LINE (2169)) ;
    }else if (kBoolFalse == test_37) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_38 = GALGAS_bool (kIsNotEqual, enumerator_77047.current_mReturnedBank (HERE).reader_uint (SOURCE_FILE_AT_LINE (2170)).objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (2170)))).boolEnum () ;
      if (kBoolTrue == test_38) {
        //-------- @addAssignInstructionForGeneration
        outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_MOVLB::constructor_new (inCompiler->here (), enumerator_77047.current_mReturnedBank (HERE) COMMA_SOURCE_FILE_AT_LINE (2171)) COMMA_SOURCE_FILE_AT_LINE (2171)) ;
      }
    }
    //-------- @addAssignInstructionForGeneration
    outArgument_outGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RETURN::constructor_new (inCompiler->here () COMMA_SOURCE_FILE_AT_LINE (2173)) COMMA_SOURCE_FILE_AT_LINE (2173)) ;
    //-------- @assignmentInstructionForGeneration
    var_entryPoint = var_entryPoint.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (2174)) ;
    enumerator_77047.gotoNextObject () ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_39 = GALGAS_bool (gOption_piccolo_5F_options_ouputListingFile.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_39) {
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (2178)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (2178)) COMMA_SOURCE_FILE_AT_LINE (2178)) ;
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*").operator_concat (GALGAS_string ("IPIC INSTRUCTION LIST").reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 77U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (2179)) COMMA_SOURCE_FILE_AT_LINE (2179)).operator_concat (GALGAS_string ("*\n") COMMA_SOURCE_FILE_AT_LINE (2179)) COMMA_SOURCE_FILE_AT_LINE (2179)) ;
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (2180)).operator_concat (GALGAS_string ("\n"
      "\n") COMMA_SOURCE_FILE_AT_LINE (2180)) COMMA_SOURCE_FILE_AT_LINE (2180)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_40 = GALGAS_bool (kIsStrictSup, var_generationOptimizationMessages.reader_length (SOURCE_FILE_AT_LINE (2181)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_40) {
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Optimizations during generation:\n") COMMA_SOURCE_FILE_AT_LINE (2182)) ;
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (var_generationOptimizationMessages COMMA_SOURCE_FILE_AT_LINE (2183)) ;
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (2184)) ;
    }
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Generated intermediate code:\n") COMMA_SOURCE_FILE_AT_LINE (2186)) ;
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_uint var_idx = GALGAS_uint ((PMUInt32) 0U) ;
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_uint var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
    //-------- @foreachInstructionForGeneration
    cEnumerator_ipic_31__38__5F_instructionList enumerator_78352 (outArgument_outGeneratedInstructionList, true) ;
    //--- simple foreach instruction
    while (enumerator_78352.hasCurrentObject ()) {
      //-------- @methodCallInstructionForGeneration
      callCategoryMethod_setCurrentAddress ((const cPtr_ipic_31__38__5F_instruction *) enumerator_78352.current_mInstruction (HERE).ptr (), var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (2190)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (var_idx.reader_string (SOURCE_FILE_AT_LINE (2191)).reader_stringByLeftPadding (GALGAS_uint ((PMUInt32) 5U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (2191)).operator_concat (GALGAS_string (": ") COMMA_SOURCE_FILE_AT_LINE (2191)) COMMA_SOURCE_FILE_AT_LINE (2191)) ;
      //-------- @methodCallInstructionForGeneration
      callCategoryMethod_displayIPICinstruction ((const cPtr_ipic_31__38__5F_instruction *) enumerator_78352.current_mInstruction (HERE).ptr (), ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (2192)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (2193)) ;
      //-------- @incrementInstructionForGeneration
      var_idx.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (2194)) ;
      enumerator_78352.gotoNextObject () ;
    }
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (2196)) ;
    //-------- @appendInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Minimum code size without optimization: ").operator_concat (var_currentAddress.reader_string (SOURCE_FILE_AT_LINE (2197)) COMMA_SOURCE_FILE_AT_LINE (2197)).operator_concat (GALGAS_string (" bytes.\n"
      "\n") COMMA_SOURCE_FILE_AT_LINE (2197)) COMMA_SOURCE_FILE_AT_LINE (2197)) ;
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
// Abstract category method '@piccolo_instruction buildIPICinstructionList'  *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_piccolo_5F_instruction_buildIPICinstructionList> gCategoryMethodTable_piccolo_5F_instruction_buildIPICinstructionList ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildIPICinstructionList (const PMSInt32 inClassIndex,
                                                   categoryMethodSignature_piccolo_5F_instruction_buildIPICinstructionList inMethod) {
  gCategoryMethodTable_piccolo_5F_instruction_buildIPICinstructionList.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

