pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void categoryMethod_instruction_5F_banksel_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                            const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                            const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                            const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                            const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                            GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                            GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                            GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                            GALGAS_uint & ioArgument_ioCurrentBank,
                                                                            const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                            GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                            const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_banksel * object = (const cPtr_instruction_5F_banksel *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_banksel) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = constinArgument_inShouldPreserveBSR.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("cannot use \"banksel\" here: BSR should be preserved (use it in \"banksave\" construct)") COMMA_SOURCE_FILE_AT_LINE (163)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (165)).objectCompare (GALGAS_uint ((PMUInt32) 15U))).boolEnum () ;
  if (kBoolTrue == test_1) {
    //-------- @errorInstructionForGeneration
    GALGAS_location location_2 (object->mAttribute_mBankIndex.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_2, GALGAS_string ("selected bank idx should be lower or equal to 15") COMMA_SOURCE_FILE_AT_LINE (166)) ;
    //-------- @assignmentInstructionForGeneration
    ioArgument_ioCurrentBank = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (167)) ;
  }else if (kBoolFalse == test_1) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_3 = GALGAS_bool (kIsEqual, object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (168)).objectCompare (ioArgument_ioCurrentBank)).boolEnum () ;
    if (kBoolTrue == test_3) {
      //-------- @warningInstructionForGeneration
      GALGAS_location location_4 (object->mAttribute_mBankIndex.reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticWarning (location_4, GALGAS_string ("useless instruction: the bank ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (169)) COMMA_SOURCE_FILE_AT_LINE (169)).operator_concat (GALGAS_string (" is already selected") COMMA_SOURCE_FILE_AT_LINE (169)) COMMA_SOURCE_FILE_AT_LINE (169)) ;
    }else if (kBoolFalse == test_3) {
      //-------- @assignmentInstructionForGeneration
      ioArgument_ioCurrentBank = object->mAttribute_mBankIndex.reader_uint (SOURCE_FILE_AT_LINE (171)) ;
    }
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_MOVLB::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mBankIndex COMMA_SOURCE_FILE_AT_LINE (174)) COMMA_SOURCE_FILE_AT_LINE (174)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_banksel_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_banksel.mSlotID,
                                                categoryMethod_instruction_5F_banksel_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_banksel_buildIPICinstructionList (defineCategoryMethod_instruction_5F_banksel_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_FDA buildIPICinstructionList'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_FDA_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                        const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                        const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                        const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                        const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                        GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                        GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                        GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                        GALGAS_uint & ioArgument_ioCurrentBank,
                                                                        const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                        GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                        const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                        C_Compiler * inCompiler
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_FDA * object = (const cPtr_instruction_5F_FDA *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_FDA) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_6716_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, joker_6716_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (193)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FDA::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mInstruction_5F_FDA_5F_base_5F_code, var_IPICregisterDescription, object->mAttribute_m_5F_W_5F_isDestination COMMA_SOURCE_FILE_AT_LINE (200)) COMMA_SOURCE_FILE_AT_LINE (200)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_FDA_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_FDA.mSlotID,
                                                categoryMethod_instruction_5F_FDA_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_FDA_buildIPICinstructionList (defineCategoryMethod_instruction_5F_FDA_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Overriding category method '@instruction_FA buildIPICinstructionList'   *
//                                                                           *
//---------------------------------------------------------------------------*

