pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_instruction_5F_JSR_buildIPICinstructionList (defineCategoryMethod_instruction_5F_JSR_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_JUMP buildIPICinstructionList'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_JUMP_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                         const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                         const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                         const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                         const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                         GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                         GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                         GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                         GALGAS_uint & ioArgument_ioCurrentBank,
                                                                         const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                         GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                         const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                         C_Compiler * inCompiler
                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_JUMP * object = (const cPtr_instruction_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_JUMP) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_isNoReturn ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_requiredBank ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_uint joker_12284_0 ; // Joker input parameter
  GALGAS_bool joker_12287_0 ; // Joker input parameter
  constinArgument_inRoutineMap.method_searchKey (object->mAttribute_mTargetLabel, var_isNoReturn, var_requiredBank, joker_12284_0, joker_12287_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (373)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (374)))).operator_and (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (ioArgument_ioCurrentBank)) COMMA_SOURCE_FILE_AT_LINE (374)).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_errorMessage = GALGAS_string ("the routine '").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (375)) COMMA_SOURCE_FILE_AT_LINE (375)).operator_concat (GALGAS_string ("' requires BSR to be set to ") COMMA_SOURCE_FILE_AT_LINE (375)).operator_concat (var_requiredBank.reader_string (SOURCE_FILE_AT_LINE (375)) COMMA_SOURCE_FILE_AT_LINE (375)) ;
    //-------- @appendInstructionForGeneration
    var_errorMessage.dotAssign_operation (GALGAS_string (", but BSR ") COMMA_SOURCE_FILE_AT_LINE (376)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, ioArgument_ioCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (377)))).boolEnum () ;
    if (kBoolTrue == test_1) {
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string ("does contain any reliable value") COMMA_SOURCE_FILE_AT_LINE (378)) ;
    }else if (kBoolFalse == test_1) {
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string ("is set to ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (380)) COMMA_SOURCE_FILE_AT_LINE (380)) COMMA_SOURCE_FILE_AT_LINE (380)) ;
    }
    //-------- @errorInstructionForGeneration
    GALGAS_location location_2 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_2, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (382)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_3 = var_isNoReturn.operator_not (SOURCE_FILE_AT_LINE (384)).boolEnum () ;
  if (kBoolTrue == test_3) {
    //-------- @errorInstructionForGeneration
    GALGAS_location location_4 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_4, GALGAS_string ("a regular routine should be called with a RCALL, CALL or JSR instruction") COMMA_SOURCE_FILE_AT_LINE (385)) ;
  }
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = GALGAS_bool (false) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabel, object->mAttribute_mKind COMMA_SOURCE_FILE_AT_LINE (389)) COMMA_SOURCE_FILE_AT_LINE (389)) ;
}
//---------------------------------------------------------------------------*

