pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void defineCategoryMethod_instruction_5F_JUMP_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_JUMP.mSlotID,
                                                categoryMethod_instruction_5F_JUMP_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_JUMP_buildIPICinstructionList (defineCategoryMethod_instruction_5F_JUMP_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_JUMPCC buildIPICinstructionList' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_JUMPCC_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                           const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                           const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                           const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                           const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                           GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                           GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                           GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                           GALGAS_uint & ioArgument_ioCurrentBank,
                                                                           const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                           GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                           const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                           C_Compiler * inCompiler
                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_JUMPCC * object = (const cPtr_instruction_5F_JUMPCC *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_JUMPCC) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_isNoReturn ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_requiredBank ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_uint joker_13702_0 ; // Joker input parameter
  GALGAS_bool joker_13705_0 ; // Joker input parameter
  constinArgument_inRoutineMap.method_searchKey (object->mAttribute_mTargetLabel, var_isNoReturn, var_requiredBank, joker_13702_0, joker_13705_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (414)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (415)))).operator_and (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (ioArgument_ioCurrentBank)) COMMA_SOURCE_FILE_AT_LINE (415)).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_errorMessage = GALGAS_string ("the routine '").operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (416)) COMMA_SOURCE_FILE_AT_LINE (416)).operator_concat (GALGAS_string ("' requires BSR to be set to ") COMMA_SOURCE_FILE_AT_LINE (416)).operator_concat (var_requiredBank.reader_string (SOURCE_FILE_AT_LINE (416)) COMMA_SOURCE_FILE_AT_LINE (416)) ;
    //-------- @appendInstructionForGeneration
    var_errorMessage.dotAssign_operation (GALGAS_string (", but BSR ") COMMA_SOURCE_FILE_AT_LINE (417)) ;
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, ioArgument_ioCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (418)))).boolEnum () ;
    if (kBoolTrue == test_1) {
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string ("does contain any reliable value") COMMA_SOURCE_FILE_AT_LINE (419)) ;
    }else if (kBoolFalse == test_1) {
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string ("is set to ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (421)) COMMA_SOURCE_FILE_AT_LINE (421)) COMMA_SOURCE_FILE_AT_LINE (421)) ;
    }
    //-------- @errorInstructionForGeneration
    GALGAS_location location_2 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_2, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (423)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_3 = var_isNoReturn.operator_not (SOURCE_FILE_AT_LINE (425)).boolEnum () ;
  if (kBoolTrue == test_3) {
    //-------- @errorInstructionForGeneration
    GALGAS_location location_4 (object->mAttribute_mTargetLabel.reader_location (HERE)) ; // Implicit use of 'location' reader
    inCompiler->emitSemanticError (location_4, GALGAS_string ("a regular routine should be called with a RCALL, CALL or JSR instruction") COMMA_SOURCE_FILE_AT_LINE (426)) ;
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_condionalBranchMode var_mode ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_5 = object->mAttribute_mIsBcc.boolEnum () ;
  if (kBoolTrue == test_5) {
    //-------- @assignmentInstructionForGeneration
    var_mode = GALGAS_condionalBranchMode::constructor_native (SOURCE_FILE_AT_LINE (431)) ;
  }else if (kBoolFalse == test_5) {
    //-------- @assignmentInstructionForGeneration
    var_mode = GALGAS_condionalBranchMode::constructor_native (SOURCE_FILE_AT_LINE (433)) ;
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_conditionalBranch::constructor_new (object->mAttribute_mInstructionLocation, var_mode, object->mAttribute_mConditionalBranch, object->mAttribute_mTargetLabel COMMA_SOURCE_FILE_AT_LINE (435)) COMMA_SOURCE_FILE_AT_LINE (435)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_JUMPCC_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_JUMPCC.mSlotID,
                                                categoryMethod_instruction_5F_JUMPCC_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_JUMPCC_buildIPICinstructionList (defineCategoryMethod_instruction_5F_JUMPCC_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_CLRWDT buildIPICinstructionList' *
//                                                                           *
//---------------------------------------------------------------------------*

