pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void categoryMethod_instruction_5F_CLRWDT_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                           const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                           const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                           const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                           const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                           GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                           GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                           GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                           GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                           const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                           GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                           const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                           C_Compiler * /* inCompiler */
                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_CLRWDT * object = (const cPtr_instruction_5F_CLRWDT *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_CLRWDT) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_CLRWDT::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (458)) COMMA_SOURCE_FILE_AT_LINE (458)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_CLRWDT_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_CLRWDT.mSlotID,
                                                categoryMethod_instruction_5F_CLRWDT_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_CLRWDT_buildIPICinstructionList (defineCategoryMethod_instruction_5F_CLRWDT_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_DAW buildIPICinstructionList'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_DAW_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                        const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                        const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                        const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                        const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                        GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                        GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                        GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                        GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                        const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                        GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                        const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_DAW * object = (const cPtr_instruction_5F_DAW *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_DAW) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_DAW::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (478)) COMMA_SOURCE_FILE_AT_LINE (478)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_DAW_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_DAW.mSlotID,
                                                categoryMethod_instruction_5F_DAW_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_DAW_buildIPICinstructionList (defineCategoryMethod_instruction_5F_DAW_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_NOP buildIPICinstructionList'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_NOP_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                        const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                        const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                        const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                        const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                        GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                        GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                        GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                        GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                        const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                        GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                        const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_NOP * object = (const cPtr_instruction_5F_NOP *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_NOP) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_NOP::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (498)) COMMA_SOURCE_FILE_AT_LINE (498)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_NOP_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_NOP.mSlotID,
                                                categoryMethod_instruction_5F_NOP_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_NOP_buildIPICinstructionList (defineCategoryMethod_instruction_5F_NOP_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_POP buildIPICinstructionList'   *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_POP_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                        const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                        const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                        const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                        const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                        GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                        GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                        GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                        GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                        const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                        GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                        const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                        C_Compiler * /* inCompiler */
                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_POP * object = (const cPtr_instruction_5F_POP *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_POP) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_POP::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (518)) COMMA_SOURCE_FILE_AT_LINE (518)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_POP_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_POP.mSlotID,
                                                categoryMethod_instruction_5F_POP_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_POP_buildIPICinstructionList (defineCategoryMethod_instruction_5F_POP_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category method '@instruction_PUSH buildIPICinstructionList'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_PUSH_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                         const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                         const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                         const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                         const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                         GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                         GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                         GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                         GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                         const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                         GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                         const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                         C_Compiler * /* inCompiler */
                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_PUSH * object = (const cPtr_instruction_5F_PUSH *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_PUSH) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_PUSH::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (538)) COMMA_SOURCE_FILE_AT_LINE (538)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_PUSH_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_PUSH.mSlotID,
                                                categoryMethod_instruction_5F_PUSH_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

