pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_instruction_5F_PUSH_buildIPICinstructionList (defineCategoryMethod_instruction_5F_PUSH_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_RESET buildIPICinstructionList'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_RESET_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                          const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                          const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                          const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                          const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                          GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                          GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                          GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                          GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                          const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                          GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                          const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                          C_Compiler * /* inCompiler */
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_RESET * object = (const cPtr_instruction_5F_RESET *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_RESET) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_RESET::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (558)) COMMA_SOURCE_FILE_AT_LINE (558)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_RESET_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_RESET.mSlotID,
                                                categoryMethod_instruction_5F_RESET_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_RESET_buildIPICinstructionList (defineCategoryMethod_instruction_5F_RESET_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@instruction_SLEEP buildIPICinstructionList'  *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_SLEEP_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                          const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                          const GALGAS_routineMap /* constinArgument_inRoutineMap */,
                                                                          const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                          const GALGAS_constantMap /* constinArgument_inConstantMap */,
                                                                          GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                          GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                          GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                          GALGAS_uint & /* ioArgument_ioCurrentBank */,
                                                                          const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                          GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                          const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                          C_Compiler * /* inCompiler */
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_SLEEP * object = (const cPtr_instruction_5F_SLEEP *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_SLEEP) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_SLEEP::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (578)) COMMA_SOURCE_FILE_AT_LINE (578)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_SLEEP_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_SLEEP.mSlotID,
                                                categoryMethod_instruction_5F_SLEEP_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_SLEEP_buildIPICinstructionList (defineCategoryMethod_instruction_5F_SLEEP_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_literalOperation buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

