pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void defineCategoryMethod_instruction_5F_MNOP_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_MNOP.mSlotID,
                                                categoryMethod_instruction_5F_MNOP_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_MNOP_buildIPICinstructionList (defineCategoryMethod_instruction_5F_MNOP_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_bra buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_bra_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                    const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                                    const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                    const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                    const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                    GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                    GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                    GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                    GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                    const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                    GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                                    const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                    C_Compiler * inCompiler
                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_bra * object = (const cPtr_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_bra) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_allPreserveBankSetting = GALGAS_bool (true) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_allReturnBank = GALGAS_bool (true) ;
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_uint var_returnedBankValue = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (777)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_26207 (object->mAttribute_mTargetLabels, true) ;
  //--- simple foreach instruction
  while (enumerator_26207.hasCurrentObject ()) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_isNoReturn ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_requiredBank ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_returnedBank ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_preservesBank ;
    //-------- @methodCallInstructionForGeneration
    constinArgument_inRoutineMap.method_searchKey (enumerator_26207.current_mValue (HERE), var_isNoReturn, var_requiredBank, var_returnedBank, var_preservesBank, inCompiler COMMA_SOURCE_FILE_AT_LINE (783)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (785)))).operator_and (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (ioArgument_ioCurrentBank)) COMMA_SOURCE_FILE_AT_LINE (785)).boolEnum () ;
    if (kBoolTrue == test_0) {
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_string var_errorMessage = GALGAS_string ("the routine '").operator_concat (enumerator_26207.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (786)) COMMA_SOURCE_FILE_AT_LINE (786)).operator_concat (GALGAS_string ("' requires BSR to be set to ") COMMA_SOURCE_FILE_AT_LINE (786)).operator_concat (var_requiredBank.reader_string (SOURCE_FILE_AT_LINE (786)) COMMA_SOURCE_FILE_AT_LINE (786)) ;
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string (", but BSR ") COMMA_SOURCE_FILE_AT_LINE (787)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, ioArgument_ioCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (788)))).boolEnum () ;
      if (kBoolTrue == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("does contain any reliable value") COMMA_SOURCE_FILE_AT_LINE (789)) ;
      }else if (kBoolFalse == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("is set to ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (791)) COMMA_SOURCE_FILE_AT_LINE (791)) COMMA_SOURCE_FILE_AT_LINE (791)) ;
      }
      //-------- @errorInstructionForGeneration
      GALGAS_location location_2 (enumerator_26207.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_2, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (793)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_3 = var_preservesBank.boolEnum () ;
    if (kBoolTrue == test_3) {
      //-------- @assignmentInstructionForGeneration
      var_allReturnBank = GALGAS_bool (false) ;
    }else if (kBoolFalse == test_3) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_4 = GALGAS_bool (kIsNotEqual, var_returnedBankValue.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (798)))).operator_and (GALGAS_bool (kIsNotEqual, var_returnedBankValue.objectCompare (var_returnedBank)) COMMA_SOURCE_FILE_AT_LINE (798)).boolEnum () ;
      if (kBoolTrue == test_4) {
        //-------- @errorInstructionForGeneration
        GALGAS_location location_5 (enumerator_26207.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
        inCompiler->emitSemanticError (location_5, GALGAS_string ("this routine ensures setting of bank '").operator_concat (var_returnedBank.reader_string (SOURCE_FILE_AT_LINE (799)) COMMA_SOURCE_FILE_AT_LINE (799)).operator_concat (GALGAS_string ("', but ") COMMA_SOURCE_FILE_AT_LINE (799)).operator_concat (GALGAS_string ("previous routine(s) ensure setting of bank '") COMMA_SOURCE_FILE_AT_LINE (800)).operator_concat (var_returnedBankValue.reader_string (SOURCE_FILE_AT_LINE (800)) COMMA_SOURCE_FILE_AT_LINE (800)).operator_concat (GALGAS_string ("'.") COMMA_SOURCE_FILE_AT_LINE (800)) COMMA_SOURCE_FILE_AT_LINE (799)) ;
      }else if (kBoolFalse == test_4) {
        //-------- @assignmentInstructionForGeneration
        var_allPreserveBankSetting = GALGAS_bool (false) ;
        //-------- @assignmentInstructionForGeneration
        var_returnedBankValue = var_returnedBank ;
      }
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_6 = GALGAS_bool (kIsNotEqual, GALGAS_routineKind::constructor_regularRoutine (SOURCE_FILE_AT_LINE (805)).objectCompare (constinArgument_inRoutineKind)).operator_and (var_isNoReturn.operator_not (SOURCE_FILE_AT_LINE (805)) COMMA_SOURCE_FILE_AT_LINE (805)).boolEnum () ;
    if (kBoolTrue == test_6) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_7 (enumerator_26207.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_7, GALGAS_string ("for being named in a computed bra from a regular routine, the '").operator_concat (enumerator_26207.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (806)) COMMA_SOURCE_FILE_AT_LINE (806)).operator_concat (GALGAS_string ("' routine should be declared without any \"noreturn\" qualifier") COMMA_SOURCE_FILE_AT_LINE (806)) COMMA_SOURCE_FILE_AT_LINE (806)) ;
    }
    enumerator_26207.gotoNextObject () ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_8 = var_allReturnBank.operator_and (var_allPreserveBankSetting.operator_not (SOURCE_FILE_AT_LINE (810)) COMMA_SOURCE_FILE_AT_LINE (810)).boolEnum () ;
  if (kBoolTrue == test_8) {
    //-------- @assignmentInstructionForGeneration
    ioArgument_ioCurrentBank = var_returnedBankValue ;
  }else if (kBoolFalse == test_8) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_9 = var_allReturnBank.operator_not (SOURCE_FILE_AT_LINE (812)).operator_and (var_allPreserveBankSetting.operator_not (SOURCE_FILE_AT_LINE (812)) COMMA_SOURCE_FILE_AT_LINE (812)).boolEnum () ;
    if (kBoolTrue == test_9) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("invoked routine should either all preserve bank, eihter return the same selected bank") COMMA_SOURCE_FILE_AT_LINE (813)) ;
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_10 = constinArgument_inShouldPreserveBSR.operator_and (var_allPreserveBankSetting.operator_not (SOURCE_FILE_AT_LINE (815)) COMMA_SOURCE_FILE_AT_LINE (815)).boolEnum () ;
  if (kBoolTrue == test_10) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("invoked routine(s) do(es) not preserve bank selection") COMMA_SOURCE_FILE_AT_LINE (816)) ;
  }
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = GALGAS_bool (false) ;
  //------- @switchInstructionForGeneration
  if (constinArgument_inRoutineKind.isValid ()) {
    switch (constinArgument_inRoutineKind.enumValue ()) {
    case GALGAS_routineKind::kNotBuilt:
      break ;
    case GALGAS_routineKind::kEnum_regularRoutine: {
      } break ;
    case GALGAS_routineKind::kEnum_noReturnRoutine: {
      } break ;
    case GALGAS_routineKind::kEnum_interruptRoutine: {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("an interrupt routine does not accept computed bra instruction") COMMA_SOURCE_FILE_AT_LINE (825)) ;
      } break ;
    }
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_sint var_size ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_eval ((const cPtr_immediatExpression *) object->mAttribute_mSizeExpression.ptr (), constinArgument_inRegisterTable, constinArgument_inConstantMap, var_size, inCompiler COMMA_SOURCE_FILE_AT_LINE (828)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_11 = GALGAS_bool (kIsStrictInf, var_size.objectCompare (GALGAS_sint ((PMSInt32) 2L))).boolEnum () ;
  if (kBoolTrue == test_11) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (830)) COMMA_SOURCE_FILE_AT_LINE (830)).operator_concat (GALGAS_string (") should be greater or equal to 2") COMMA_SOURCE_FILE_AT_LINE (830)) COMMA_SOURCE_FILE_AT_LINE (830)) ;
  }else if (kBoolFalse == test_11) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_12 = GALGAS_bool (kIsStrictSup, var_size.objectCompare (GALGAS_sint ((PMSInt32) 128L))).boolEnum () ;
    if (kBoolTrue == test_12) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (832)) COMMA_SOURCE_FILE_AT_LINE (832)).operator_concat (GALGAS_string (") should be lower or equal to 128") COMMA_SOURCE_FILE_AT_LINE (832)) COMMA_SOURCE_FILE_AT_LINE (832)) ;
    }else if (kBoolFalse == test_12) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_13 = GALGAS_bool (kIsNotEqual, var_size.reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (833)).objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (833)))).boolEnum () ;
      if (kBoolTrue == test_13) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the routine name list length (").operator_concat (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (834)).reader_string (SOURCE_FILE_AT_LINE (834)) COMMA_SOURCE_FILE_AT_LINE (834)).operator_concat (GALGAS_string (") should be equal to the computed range (") COMMA_SOURCE_FILE_AT_LINE (834)).operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (834)) COMMA_SOURCE_FILE_AT_LINE (834)).operator_concat (GALGAS_string (")") COMMA_SOURCE_FILE_AT_LINE (834)) COMMA_SOURCE_FILE_AT_LINE (834)) ;
      }
    }
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_bra::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, object->mAttribute_mUsesRelativeCall COMMA_SOURCE_FILE_AT_LINE (837)) COMMA_SOURCE_FILE_AT_LINE (837)) ;
}
//---------------------------------------------------------------------------*

