pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void defineCategoryMethod_instruction_5F_computed_5F_bra_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_bra.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_bra_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_bra_buildIPICinstructionList (defineCategoryMethod_instruction_5F_computed_5F_bra_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_goto buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_goto_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                     const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                                     const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                     const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                     const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                     GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                     GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                     GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                     GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                     const GALGAS_bool /* constinArgument_inShouldPreserveBSR */,
                                                                                     GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                                     const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_goto * object = (const cPtr_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_goto) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_29740 (object->mAttribute_mTargetLabels, true) ;
  //--- simple foreach instruction
  while (enumerator_29740.hasCurrentObject ()) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_isNoReturn ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_requiredBank ;
    //-------- @methodCallInstructionForGeneration
    GALGAS_uint joker_29853_0 ; // Joker input parameter
    GALGAS_bool joker_29856_0 ; // Joker input parameter
    constinArgument_inRoutineMap.method_searchKey (enumerator_29740.current_mValue (HERE), var_isNoReturn, var_requiredBank, joker_29853_0, joker_29856_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (863)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (864)))).operator_and (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (ioArgument_ioCurrentBank)) COMMA_SOURCE_FILE_AT_LINE (864)).boolEnum () ;
    if (kBoolTrue == test_0) {
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_string var_errorMessage = GALGAS_string ("the routine '").operator_concat (enumerator_29740.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (865)) COMMA_SOURCE_FILE_AT_LINE (865)).operator_concat (GALGAS_string ("' requires BSR to be set to ") COMMA_SOURCE_FILE_AT_LINE (865)).operator_concat (var_requiredBank.reader_string (SOURCE_FILE_AT_LINE (865)) COMMA_SOURCE_FILE_AT_LINE (865)) ;
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string (", but BSR ") COMMA_SOURCE_FILE_AT_LINE (866)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, ioArgument_ioCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (867)))).boolEnum () ;
      if (kBoolTrue == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("does contain any reliable value") COMMA_SOURCE_FILE_AT_LINE (868)) ;
      }else if (kBoolFalse == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("is set to ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (870)) COMMA_SOURCE_FILE_AT_LINE (870)) COMMA_SOURCE_FILE_AT_LINE (870)) ;
      }
      //-------- @errorInstructionForGeneration
      GALGAS_location location_2 (enumerator_29740.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_2, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (872)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_3 = var_isNoReturn.operator_not (SOURCE_FILE_AT_LINE (874)).boolEnum () ;
    if (kBoolTrue == test_3) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_4 (enumerator_29740.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_4, GALGAS_string ("for being named in a computed goto, the '").operator_concat (enumerator_29740.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (875)) COMMA_SOURCE_FILE_AT_LINE (875)).operator_concat (GALGAS_string ("' routine should be declared with the \"noreturn\" qualifier") COMMA_SOURCE_FILE_AT_LINE (875)) COMMA_SOURCE_FILE_AT_LINE (875)) ;
    }
    enumerator_29740.gotoNextObject () ;
  }
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = GALGAS_bool (false) ;
  //------- @switchInstructionForGeneration
  if (constinArgument_inRoutineKind.isValid ()) {
    switch (constinArgument_inRoutineKind.enumValue ()) {
    case GALGAS_routineKind::kNotBuilt:
      break ;
    case GALGAS_routineKind::kEnum_regularRoutine: {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("a regular routine does not accept computed goto instruction") COMMA_SOURCE_FILE_AT_LINE (881)) ;
      } break ;
    case GALGAS_routineKind::kEnum_noReturnRoutine: {
      } break ;
    case GALGAS_routineKind::kEnum_interruptRoutine: {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("an interrupt routine does not accept computed goto instruction") COMMA_SOURCE_FILE_AT_LINE (884)) ;
      } break ;
    }
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_sint var_size ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_eval ((const cPtr_immediatExpression *) object->mAttribute_mSizeExpression.ptr (), constinArgument_inRegisterTable, constinArgument_inConstantMap, var_size, inCompiler COMMA_SOURCE_FILE_AT_LINE (887)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_5 = GALGAS_bool (kIsStrictInf, var_size.objectCompare (GALGAS_sint ((PMSInt32) 2L))).boolEnum () ;
  if (kBoolTrue == test_5) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (889)) COMMA_SOURCE_FILE_AT_LINE (889)).operator_concat (GALGAS_string (") should be greater or equal to 2") COMMA_SOURCE_FILE_AT_LINE (889)) COMMA_SOURCE_FILE_AT_LINE (889)) ;
  }else if (kBoolFalse == test_5) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_6 = GALGAS_bool (kIsStrictSup, var_size.objectCompare (GALGAS_sint ((PMSInt32) 64L))).boolEnum () ;
    if (kBoolTrue == test_6) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (891)) COMMA_SOURCE_FILE_AT_LINE (891)).operator_concat (GALGAS_string (") should be lower or equal to 64") COMMA_SOURCE_FILE_AT_LINE (891)) COMMA_SOURCE_FILE_AT_LINE (891)) ;
    }else if (kBoolFalse == test_6) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_7 = GALGAS_bool (kIsNotEqual, var_size.reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (892)).objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (892)))).boolEnum () ;
      if (kBoolTrue == test_7) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the routine name list length (").operator_concat (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (893)).reader_string (SOURCE_FILE_AT_LINE (893)) COMMA_SOURCE_FILE_AT_LINE (893)).operator_concat (GALGAS_string (") should be equal to the computed range (") COMMA_SOURCE_FILE_AT_LINE (893)).operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (893)) COMMA_SOURCE_FILE_AT_LINE (893)).operator_concat (GALGAS_string (")") COMMA_SOURCE_FILE_AT_LINE (893)) COMMA_SOURCE_FILE_AT_LINE (893)) ;
      }
    }
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_goto::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, object->mAttribute_mUsesRelativeCall COMMA_SOURCE_FILE_AT_LINE (896)) COMMA_SOURCE_FILE_AT_LINE (896)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_goto_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_goto.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_goto_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

