pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_instruction_5F_computed_5F_goto_buildIPICinstructionList (defineCategoryMethod_instruction_5F_computed_5F_goto_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_computed_rcall buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_computed_5F_rcall_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                      const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                                      const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                      const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                      const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                      GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                                      GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                      GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                      GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                      const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                      GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                                      const GALGAS_routineKind /* constinArgument_inRoutineKind */,
                                                                                      C_Compiler * inCompiler
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_computed_5F_rcall * object = (const cPtr_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_computed_5F_rcall) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_allPreserveBank = GALGAS_bool (true) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_someReturnsBank = GALGAS_bool (false) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_returnedBankSelection = ioArgument_ioCurrentBank ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_lstringlist enumerator_32265 (object->mAttribute_mTargetLabels, true) ;
  //--- simple foreach instruction
  while (enumerator_32265.hasCurrentObject ()) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_isNoReturn ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_requiredBank ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_returnedBank ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_bool var_preservesBank ;
    //-------- @methodCallInstructionForGeneration
    constinArgument_inRoutineMap.method_searchKey (enumerator_32265.current_mValue (HERE), var_isNoReturn, var_requiredBank, var_returnedBank, var_preservesBank, inCompiler COMMA_SOURCE_FILE_AT_LINE (927)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (928)))).operator_and (GALGAS_bool (kIsNotEqual, var_requiredBank.objectCompare (ioArgument_ioCurrentBank)) COMMA_SOURCE_FILE_AT_LINE (928)).boolEnum () ;
    if (kBoolTrue == test_0) {
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_string var_errorMessage = GALGAS_string ("the routine '").operator_concat (enumerator_32265.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (929)) COMMA_SOURCE_FILE_AT_LINE (929)).operator_concat (GALGAS_string ("' requires BSR to be set to ") COMMA_SOURCE_FILE_AT_LINE (929)).operator_concat (var_requiredBank.reader_string (SOURCE_FILE_AT_LINE (929)) COMMA_SOURCE_FILE_AT_LINE (929)) ;
      //-------- @appendInstructionForGeneration
      var_errorMessage.dotAssign_operation (GALGAS_string (", but BSR ") COMMA_SOURCE_FILE_AT_LINE (930)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, ioArgument_ioCurrentBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (931)))).boolEnum () ;
      if (kBoolTrue == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("does contain any reliable value") COMMA_SOURCE_FILE_AT_LINE (932)) ;
      }else if (kBoolFalse == test_1) {
        //-------- @appendInstructionForGeneration
        var_errorMessage.dotAssign_operation (GALGAS_string ("is set to ").operator_concat (ioArgument_ioCurrentBank.reader_string (SOURCE_FILE_AT_LINE (934)) COMMA_SOURCE_FILE_AT_LINE (934)) COMMA_SOURCE_FILE_AT_LINE (934)) ;
      }
      //-------- @errorInstructionForGeneration
      GALGAS_location location_2 (enumerator_32265.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_2, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (936)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_3 = var_isNoReturn.boolEnum () ;
    if (kBoolTrue == test_3) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_4 (enumerator_32265.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_4, GALGAS_string ("for being named in a computed rcall, the '").operator_concat (enumerator_32265.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (939)) COMMA_SOURCE_FILE_AT_LINE (939)).operator_concat (GALGAS_string ("' routine should be declared without the \"noreturn\" qualifier") COMMA_SOURCE_FILE_AT_LINE (939)) COMMA_SOURCE_FILE_AT_LINE (939)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_5 = constinArgument_inShouldPreserveBSR.operator_and (var_preservesBank.operator_not (SOURCE_FILE_AT_LINE (941)) COMMA_SOURCE_FILE_AT_LINE (941)).boolEnum () ;
    if (kBoolTrue == test_5) {
      //-------- @errorInstructionForGeneration
      GALGAS_location location_6 (enumerator_32265.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
      inCompiler->emitSemanticError (location_6, GALGAS_string ("the '").operator_concat (enumerator_32265.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (942)) COMMA_SOURCE_FILE_AT_LINE (942)).operator_concat (GALGAS_string ("' routine should preserved bank selection") COMMA_SOURCE_FILE_AT_LINE (942)) COMMA_SOURCE_FILE_AT_LINE (942)) ;
    }else if (kBoolFalse == test_5) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_7 = constinArgument_inShouldPreserveBSR.operator_not (SOURCE_FILE_AT_LINE (943)).operator_and (var_preservesBank.operator_not (SOURCE_FILE_AT_LINE (943)) COMMA_SOURCE_FILE_AT_LINE (943)).boolEnum () ;
      if (kBoolTrue == test_7) {
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_8 = var_someReturnsBank.operator_not (SOURCE_FILE_AT_LINE (944)).boolEnum () ;
        if (kBoolTrue == test_8) {
          //-------- @assignmentInstructionForGeneration
          var_returnedBankSelection = var_returnedBank ;
          //-------- @assignmentInstructionForGeneration
          var_someReturnsBank = GALGAS_bool (true) ;
        }else if (kBoolFalse == test_8) {
          //-------- @ifInstructionForGeneration
          const enumGalgasBool test_9 = GALGAS_bool (kIsNotEqual, var_returnedBankSelection.objectCompare (var_returnedBank)).boolEnum () ;
          if (kBoolTrue == test_9) {
            //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
            GALGAS_string var_errorMessage = GALGAS_string ("the '").operator_concat (enumerator_32265.current_mValue (HERE).reader_string (SOURCE_FILE_AT_LINE (948)) COMMA_SOURCE_FILE_AT_LINE (948)).operator_concat (GALGAS_string ("' routine returns ") COMMA_SOURCE_FILE_AT_LINE (948)) ;
            //-------- @ifInstructionForGeneration
            const enumGalgasBool test_10 = GALGAS_bool (kIsEqual, var_returnedBank.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (949)))).boolEnum () ;
            if (kBoolTrue == test_10) {
              //-------- @appendInstructionForGeneration
              var_errorMessage.dotAssign_operation (GALGAS_string ("no bank selection") COMMA_SOURCE_FILE_AT_LINE (950)) ;
            }else if (kBoolFalse == test_10) {
              //-------- @appendInstructionForGeneration
              var_errorMessage.dotAssign_operation (GALGAS_string ("bank selection set to  ").operator_concat (var_returnedBank.reader_string (SOURCE_FILE_AT_LINE (952)) COMMA_SOURCE_FILE_AT_LINE (952)) COMMA_SOURCE_FILE_AT_LINE (952)) ;
            }
            //-------- @appendInstructionForGeneration
            var_errorMessage.dotAssign_operation (GALGAS_string (", but previous routine(s) return(s) ") COMMA_SOURCE_FILE_AT_LINE (954)) ;
            //-------- @ifInstructionForGeneration
            const enumGalgasBool test_11 = GALGAS_bool (kIsEqual, var_returnedBankSelection.objectCompare (GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (955)))).boolEnum () ;
            if (kBoolTrue == test_11) {
              //-------- @appendInstructionForGeneration
              var_errorMessage.dotAssign_operation (GALGAS_string ("no bank selection") COMMA_SOURCE_FILE_AT_LINE (956)) ;
            }else if (kBoolFalse == test_11) {
              //-------- @appendInstructionForGeneration
              var_errorMessage.dotAssign_operation (GALGAS_string ("bank selection set to  ").operator_concat (var_returnedBankSelection.reader_string (SOURCE_FILE_AT_LINE (958)) COMMA_SOURCE_FILE_AT_LINE (958)) COMMA_SOURCE_FILE_AT_LINE (958)) ;
            }
            //-------- @errorInstructionForGeneration
            GALGAS_location location_12 (enumerator_32265.current_mValue (HERE).reader_location (HERE)) ; // Implicit use of 'location' reader
            inCompiler->emitSemanticError (location_12, var_errorMessage COMMA_SOURCE_FILE_AT_LINE (960)) ;
          }
        }
      }else if (kBoolFalse == test_7) {
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_13 = constinArgument_inShouldPreserveBSR.operator_not (SOURCE_FILE_AT_LINE (962)).operator_and (var_preservesBank COMMA_SOURCE_FILE_AT_LINE (962)).boolEnum () ;
        if (kBoolTrue == test_13) {
        }
      }
    }
    enumerator_32265.gotoNextObject () ;
  }
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = GALGAS_bool (true) ;
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioCurrentBank = var_returnedBankSelection ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_sint var_size ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_eval ((const cPtr_immediatExpression *) object->mAttribute_mSizeExpression.ptr (), constinArgument_inRegisterTable, constinArgument_inConstantMap, var_size, inCompiler COMMA_SOURCE_FILE_AT_LINE (969)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_14 = GALGAS_bool (kIsStrictInf, var_size.objectCompare (GALGAS_sint ((PMSInt32) 2L))).boolEnum () ;
  if (kBoolTrue == test_14) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (971)) COMMA_SOURCE_FILE_AT_LINE (971)).operator_concat (GALGAS_string (") should be greater or equal to 2") COMMA_SOURCE_FILE_AT_LINE (971)) COMMA_SOURCE_FILE_AT_LINE (971)) ;
  }else if (kBoolFalse == test_14) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_15 = GALGAS_bool (kIsStrictSup, var_size.objectCompare (GALGAS_sint ((PMSInt32) 64L))).boolEnum () ;
    if (kBoolTrue == test_15) {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the computed range (").operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (973)) COMMA_SOURCE_FILE_AT_LINE (973)).operator_concat (GALGAS_string (") should be lower or equal to 64") COMMA_SOURCE_FILE_AT_LINE (973)) COMMA_SOURCE_FILE_AT_LINE (973)) ;
    }else if (kBoolFalse == test_15) {
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_16 = GALGAS_bool (kIsNotEqual, var_size.reader_uint (inCompiler COMMA_SOURCE_FILE_AT_LINE (974)).objectCompare (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (974)))).boolEnum () ;
      if (kBoolTrue == test_16) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("the routine name list length (").operator_concat (object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (975)).reader_string (SOURCE_FILE_AT_LINE (975)) COMMA_SOURCE_FILE_AT_LINE (975)).operator_concat (GALGAS_string (") should be equal to the computed range (") COMMA_SOURCE_FILE_AT_LINE (975)).operator_concat (var_size.reader_string (SOURCE_FILE_AT_LINE (975)) COMMA_SOURCE_FILE_AT_LINE (975)).operator_concat (GALGAS_string (")") COMMA_SOURCE_FILE_AT_LINE (975)) COMMA_SOURCE_FILE_AT_LINE (975)) ;
      }
    }
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_label_30_ = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (978)) COMMA_SOURCE_FILE_AT_LINE (978)) ;
  //-------- @incrementInstructionForGeneration
  ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (979)) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_computed_5F_rcall::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabels, var_label_30_, object->mAttribute_mUsesRelativeCall COMMA_SOURCE_FILE_AT_LINE (980)) COMMA_SOURCE_FILE_AT_LINE (980)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_computed_5F_rcall_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_computed_5F_rcall.mSlotID,
                                                categoryMethod_instruction_5F_computed_5F_rcall_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_computed_5F_rcall_buildIPICinstructionList (defineCategoryMethod_instruction_5F_computed_5F_rcall_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_FOREVER buildIPICinstructionList' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_FOREVER_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                            const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                            const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                            const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                            const GALGAS_constantMap constinArgument_inConstantMap,
                                                                            GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                            GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                            GALGAS_string & ioArgument_ioListFileContents,
                                                                            GALGAS_uint & ioArgument_ioCurrentBank,
                                                                            const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                            GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                            const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                            C_Compiler * inCompiler
                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_FOREVER * object = (const cPtr_instruction_5F_FOREVER *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_FOREVER) ;
  //------- @switchInstructionForGeneration
  if (constinArgument_inRoutineKind.isValid ()) {
    switch (constinArgument_inRoutineKind.enumValue ()) {
    case GALGAS_routineKind::kNotBuilt:
      break ;
    case GALGAS_routineKind::kEnum_regularRoutine: {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("a regular routine does not accept the \"forever\" instruction") COMMA_SOURCE_FILE_AT_LINE (1005)) ;
      } break ;
    case GALGAS_routineKind::kEnum_noReturnRoutine: {
      } break ;
    case GALGAS_routineKind::kEnum_interruptRoutine: {
      //-------- @errorInstructionForGeneration
      inCompiler->emitSemanticError (object->mAttribute_mInstructionLocation, GALGAS_string ("an interrupt routine does not accept the \"forever\" instruction") COMMA_SOURCE_FILE_AT_LINE (1008)) ;
      } break ;
    }
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_finalBank = ioArgument_ioCurrentBank ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_label_30_ = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1012)) COMMA_SOURCE_FILE_AT_LINE (1012)) ;
  //-------- @incrementInstructionForGeneration
  ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1013)) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_30_, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1014)) COMMA_SOURCE_FILE_AT_LINE (1014)) COMMA_SOURCE_FILE_AT_LINE (1014)) ;
  { //-------- @routineCallInstructionForGeneration
  routine_handleInstructionList (object->mAttribute_mInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_finalBank, constinArgument_inShouldPreserveBSR, ioArgument_ioContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1015)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, ioArgument_ioCurrentBank.objectCompare (var_finalBank)).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mEndOfInstructionList, GALGAS_string ("instruction list does not leave BSR value unchanged") COMMA_SOURCE_FILE_AT_LINE (1030)) ;
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_lstring::constructor_new (var_label_30_, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1033)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1033)) COMMA_SOURCE_FILE_AT_LINE (1033)) COMMA_SOURCE_FILE_AT_LINE (1033)) ;
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = GALGAS_bool (false) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_FOREVER_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_FOREVER.mSlotID,
                                                categoryMethod_instruction_5F_FOREVER_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_FOREVER_buildIPICinstructionList (defineCategoryMethod_instruction_5F_FOREVER_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_IF_FA_SEMI_COLON buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

