pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void categoryMethod_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                              const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                              const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                              const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                              const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                              GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                                              GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                              GALGAS_string & ioArgument_ioListFileContents,
                                                                                              GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                              const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                              GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                                              const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                              C_Compiler * inCompiler
                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON * object = (const cPtr_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_FA_5F_instruction_5F_base_5F_code var_baseCode ;
  //------- @switchInstructionForGeneration
  if (object->mAttribute_mOpCode.isValid ()) {
    switch (object->mAttribute_mOpCode.enumValue ()) {
    case GALGAS_if_5F_semi_5F_colon_5F_op::kNotBuilt:
      break ;
    case GALGAS_if_5F_semi_5F_colon_5F_op::kEnum_CPFSEQ: {
      //-------- @assignmentInstructionForGeneration
      var_baseCode = GALGAS_FA_5F_instruction_5F_base_5F_code::constructor_CPFSEQ (SOURCE_FILE_AT_LINE (1055)) ;
      } break ;
    case GALGAS_if_5F_semi_5F_colon_5F_op::kEnum_CPFSGT: {
      //-------- @assignmentInstructionForGeneration
      var_baseCode = GALGAS_FA_5F_instruction_5F_base_5F_code::constructor_CPFSGT (SOURCE_FILE_AT_LINE (1056)) ;
      } break ;
    case GALGAS_if_5F_semi_5F_colon_5F_op::kEnum_CPFSLT: {
      //-------- @assignmentInstructionForGeneration
      var_baseCode = GALGAS_FA_5F_instruction_5F_base_5F_code::constructor_CPFSLT (SOURCE_FILE_AT_LINE (1057)) ;
      } break ;
    case GALGAS_if_5F_semi_5F_colon_5F_op::kEnum_TSTFSZ: {
      //-------- @assignmentInstructionForGeneration
      var_baseCode = GALGAS_FA_5F_instruction_5F_base_5F_code::constructor_TSTFSZ (SOURCE_FILE_AT_LINE (1058)) ;
      } break ;
    }
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_37901_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, joker_37901_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1061)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_FA::constructor_new (object->mAttribute_mInstructionLocation, var_baseCode, var_IPICregisterDescription COMMA_SOURCE_FILE_AT_LINE (1068)) COMMA_SOURCE_FILE_AT_LINE (1068)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_unusedContinuesInSequence = GALGAS_bool (true) ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_buildIPICinstructionList ((const cPtr_piccolo_5F_instruction *) object->mAttribute_mInstruction.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, ioArgument_ioCurrentBank, constinArgument_inShouldPreserveBSR, var_unusedContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1075)) ;
  //-------- END @methodCallInstructionForGeneration
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON.mSlotID,
                                                categoryMethod_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON_buildIPICinstructionList (defineCategoryMethod_instruction_5F_IF_5F_FA_5F_SEMI_5F_COLON_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_IF_BitTest buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_IF_5F_BitTest_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                  const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                  const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                  const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                  const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                  GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                                  GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                  GALGAS_string & ioArgument_ioListFileContents,
                                                                                  GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                  const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                  GALGAS_bool & /* ioArgument_ioContinuesInSequence */,
                                                                                  const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                  C_Compiler * inCompiler
                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_IF_5F_BitTest * object = (const cPtr_instruction_5F_IF_5F_BitTest *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_IF_5F_BitTest) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bitSliceTable var_bitSliceTable ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, var_bitSliceTable, inCompiler COMMA_SOURCE_FILE_AT_LINE (1107)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_bitNumber ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_getBitNumber ((const cPtr_bitNumberExpression *) object->mAttribute_mBitNumber.ptr (), var_bitSliceTable, var_bitNumber, inCompiler COMMA_SOURCE_FILE_AT_LINE (1115)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_BitTestSkip::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mSkipIfSet, var_IPICregisterDescription, var_bitNumber COMMA_SOURCE_FILE_AT_LINE (1119)) COMMA_SOURCE_FILE_AT_LINE (1119)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_unusedContinuesInSequence = GALGAS_bool (true) ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_buildIPICinstructionList ((const cPtr_piccolo_5F_instruction *) object->mAttribute_mInstruction.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, ioArgument_ioCurrentBank, constinArgument_inShouldPreserveBSR, var_unusedContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1127)) ;
  //-------- END @methodCallInstructionForGeneration
}
//---------------------------------------------------------------------------*

