pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void defineCategoryMethod_instruction_5F_IF_5F_BitTest_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_IF_5F_BitTest.mSlotID,
                                                categoryMethod_instruction_5F_IF_5F_BitTest_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_IF_5F_BitTest_buildIPICinstructionList (defineCategoryMethod_instruction_5F_IF_5F_BitTest_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@conditionExpression buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_conditionExpression_buildIPICinstructionForCondition> gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_buildIPICinstructionForCondition (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_conditionExpression_buildIPICinstructionForCondition inMethod) {
  gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_conditionExpression_buildIPICinstructionForCondition (void) {
  gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_conditionExpression_buildIPICinstructionForCondition (NULL,
                                                                                 freeCategoryMethod_conditionExpression_buildIPICinstructionForCondition) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                          const GALGAS_uint constin_inAccessBankSplitOffset,
                                                          const GALGAS_uint constin_inCurrentBank,
                                                          const GALGAS_registerTable constin_inRegisterTable,
                                                          GALGAS_uint & io_ioLocalLabelIndex,
                                                          const GALGAS_bool constin_inComplementaryBranch,
                                                          const GALGAS_location constin_inInstructionLocation,
                                                          const GALGAS_string constin_inTargetLabel,
                                                          GALGAS_ipic_31__38__5F_instructionList & io_ioGeneratedInstructionList,
                                                          GALGAS_string & io_ioListFileContents,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) {
//--- Drop output arguments
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_conditionExpression) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_conditionExpression_buildIPICinstructionForCondition f = NULL ;
    if (classIndex < gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition.count ()) {
      f = gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition.count ()) {
           f = gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_conditionExpression_buildIPICinstructionForCondition.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    f (inObject, constin_inAccessBankSplitOffset, constin_inCurrentBank, constin_inRegisterTable, io_ioLocalLabelIndex, constin_inComplementaryBranch, constin_inInstructionLocation, constin_inTargetLabel, io_ioGeneratedInstructionList, io_ioListFileContents, inCompiler COMMA_THERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@conditionExpression computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_conditionExpression_computeInstructionCountForCondition> gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_computeInstructionCountForCondition (const PMSInt32 inClassIndex,
                                                              categoryMethodSignature_conditionExpression_computeInstructionCountForCondition inMethod) {
  gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_conditionExpression_computeInstructionCountForCondition (void) {
  gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_conditionExpression_computeInstructionCountForCondition (NULL,
                                                                                    freeCategoryMethod_conditionExpression_computeInstructionCountForCondition) ;

//---------------------------------------------------------------------------*

