pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
void callCategoryMethod_computeInstructionCountForCondition (const cPtr_conditionExpression * inObject,
                                                             const GALGAS_bool constin_inComplementaryBranch,
                                                             GALGAS_uint & out_outInstructionCount,
                                                             C_Compiler * inCompiler
                                                             COMMA_LOCATION_ARGS) {
//--- Drop output arguments
  out_outInstructionCount.drop () ;
//--- Find method
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_conditionExpression) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_conditionExpression_computeInstructionCountForCondition f = NULL ;
    if (classIndex < gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition.count ()) {
      f = gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition.count ()) {
           f = gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_conditionExpression_computeInstructionCountForCondition.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    f (inObject, constin_inComplementaryBranch, out_outInstructionCount, inCompiler COMMA_THERE) ;
  }
}

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@bcc_in_structured_if_condition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                                                        const GALGAS_uint /* constinArgument_inAccessBankSplitOffset */,
                                                                                                        const GALGAS_uint /* constinArgument_inCurrentBank */,
                                                                                                        const GALGAS_registerTable /* constinArgument_inRegisterTable */,
                                                                                                        GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                                        const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                                        const GALGAS_location constinArgument_inInstructionLocation,
                                                                                                        const GALGAS_string constinArgument_inTargetLabel,
                                                                                                        GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                        GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_bcc_5F_in_5F_structured_5F_if_5F_condition * object = (const cPtr_bcc_5F_in_5F_structured_5F_if_5F_condition *) inObject ;
  macroValidSharedObject (object, const cPtr_bcc_5F_in_5F_structured_5F_if_5F_condition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_conditional_5F_branch var_condition ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = constinArgument_inComplementaryBranch.boolEnum () ;
  if (kBoolTrue == test_0) {
    { //-------- @routineCallInstructionForGeneration
    routine_getComplementaryBcc (object->mAttribute_mCondition, var_condition, inCompiler COMMA_SOURCE_FILE_AT_LINE (1178)) ;
    } //-------- @routineCallInstructionForGeneration
  }else if (kBoolFalse == test_0) {
    //-------- @assignmentInstructionForGeneration
    var_condition = object->mAttribute_mCondition ;
  }
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_conditionalBranch::constructor_new (constinArgument_inInstructionLocation, GALGAS_condionalBranchMode::constructor_native (SOURCE_FILE_AT_LINE (1184)), var_condition, GALGAS_lstring::constructor_new (constinArgument_inTargetLabel, constinArgument_inInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1186)) COMMA_SOURCE_FILE_AT_LINE (1182)) COMMA_SOURCE_FILE_AT_LINE (1182)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_bcc_5F_in_5F_structured_5F_if_5F_condition.mSlotID,
                                                        categoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (defineCategoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@bcc_in_structured_if_condition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (const cPtr_conditionExpression * /* inObject */,
                                                                                                           const GALGAS_bool /* constinArgument_inComplementaryBranch */,
                                                                                                           GALGAS_uint & outArgument_outInstructionCount,
                                                                                                           C_Compiler * /* inCompiler */
                                                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outInstructionCount = GALGAS_uint ((PMUInt32) 2U) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_bcc_5F_in_5F_structured_5F_if_5F_condition.mSlotID,
                                                           categoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (defineCategoryMethod_bcc_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@registerComparisonCondition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_registerComparisonCondition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                                         const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                         const GALGAS_uint constinArgument_inCurrentBank,
                                                                                         const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                         GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                         const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                         const GALGAS_location constinArgument_inInstructionLocation,
                                                                                         const GALGAS_string constinArgument_inTargetLabel,
                                                                                         GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                         GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerComparisonCondition * object = (const cPtr_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_registerComparisonCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_registerComparison var_comparison ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = constinArgument_inComplementaryBranch.boolEnum () ;
  if (kBoolTrue == test_0) {
    { //-------- @routineCallInstructionForGeneration
    routine_getRegisterComparisonComplementary (object->mAttribute_mComparison, var_comparison, inCompiler COMMA_SOURCE_FILE_AT_LINE (1214)) ;
    } //-------- @routineCallInstructionForGeneration
  }else if (kBoolFalse == test_0) {
    //-------- @assignmentInstructionForGeneration
    var_comparison = object->mAttribute_mComparison ;
  }
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_42402_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, joker_42402_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1220)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_registerComparisonCondition::constructor_new (constinArgument_inInstructionLocation, var_IPICregisterDescription, constinArgument_inTargetLabel, var_comparison, GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (1228)) COMMA_SOURCE_FILE_AT_LINE (1228)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerComparisonCondition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_registerComparisonCondition.mSlotID,
                                                        categoryMethod_registerComparisonCondition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_registerComparisonCondition_buildIPICinstructionForCondition (defineCategoryMethod_registerComparisonCondition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@registerComparisonCondition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_registerComparisonCondition_computeInstructionCountForCondition (const cPtr_conditionExpression * inObject,
                                                                                            const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                            GALGAS_uint & outArgument_outInstructionCount,
                                                                                            C_Compiler * inCompiler
                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerComparisonCondition * object = (const cPtr_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_registerComparisonCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_registerComparison var_comparison ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = constinArgument_inComplementaryBranch.boolEnum () ;
  if (kBoolTrue == test_0) {
    { //-------- @routineCallInstructionForGeneration
    routine_getRegisterComparisonComplementary (object->mAttribute_mComparison, var_comparison, inCompiler COMMA_SOURCE_FILE_AT_LINE (1245)) ;
    } //-------- @routineCallInstructionForGeneration
  }else if (kBoolFalse == test_0) {
    //-------- @assignmentInstructionForGeneration
    var_comparison = object->mAttribute_mComparison ;
  }
  { //-------- @routineCallInstructionForGeneration
  routine_getRegisterComparisonInstructionCount (var_comparison, outArgument_outInstructionCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1249)) ;
  } //-------- @routineCallInstructionForGeneration
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerComparisonCondition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_registerComparisonCondition.mSlotID,
                                                           categoryMethod_registerComparisonCondition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

