pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_registerComparisonCondition_computeInstructionCountForCondition (defineCategoryMethod_registerComparisonCondition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@incDecRegisterInCondition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_incDecRegisterInCondition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                                       const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                       const GALGAS_uint constinArgument_inCurrentBank,
                                                                                       const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                       GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                       const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                       const GALGAS_location constinArgument_inInstructionLocation,
                                                                                       const GALGAS_string constinArgument_inTargetLabel,
                                                                                       GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                       GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_incDecRegisterInCondition * object = (const cPtr_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_incDecRegisterInCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_43745_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, joker_43745_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1266)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_incDecRegisterInCondition::constructor_new (constinArgument_inInstructionLocation, var_IPICregisterDescription, constinArgument_inTargetLabel, object->mAttribute_mIncrement, object->mAttribute_m_5F_W_5F_isDestination, object->mAttribute_mBranchIfZero.operator_xor (constinArgument_inComplementaryBranch COMMA_SOURCE_FILE_AT_LINE (1280)), GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (1274)) COMMA_SOURCE_FILE_AT_LINE (1274)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_incDecRegisterInCondition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_incDecRegisterInCondition.mSlotID,
                                                        categoryMethod_incDecRegisterInCondition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_incDecRegisterInCondition_buildIPICinstructionForCondition (defineCategoryMethod_incDecRegisterInCondition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@incDecRegisterInCondition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_incDecRegisterInCondition_computeInstructionCountForCondition (const cPtr_conditionExpression * /* inObject */,
                                                                                          const GALGAS_bool /* constinArgument_inComplementaryBranch */,
                                                                                          GALGAS_uint & outArgument_outInstructionCount,
                                                                                          C_Compiler * /* inCompiler */
                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outInstructionCount = GALGAS_uint ((PMUInt32) 2U) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_incDecRegisterInCondition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_incDecRegisterInCondition.mSlotID,
                                                           categoryMethod_incDecRegisterInCondition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_incDecRegisterInCondition_computeInstructionCountForCondition (defineCategoryMethod_incDecRegisterInCondition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@registerTestCondition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

