pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void categoryMethod_registerTestCondition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                                   const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                   const GALGAS_uint constinArgument_inCurrentBank,
                                                                                   const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                   GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                   const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                   const GALGAS_location constinArgument_inInstructionLocation,
                                                                                   const GALGAS_string constinArgument_inTargetLabel,
                                                                                   GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                   GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                   C_Compiler * inCompiler
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerTestCondition * object = (const cPtr_registerTestCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_registerTestCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bitSliceTable joker_44924_0 ; // Joker input parameter
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, joker_44924_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (1308)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_jump_5F_test_5F_register::constructor_new (constinArgument_inInstructionLocation, var_IPICregisterDescription, constinArgument_inTargetLabel, object->mAttribute_mBranchIfZero.operator_xor (constinArgument_inComplementaryBranch COMMA_SOURCE_FILE_AT_LINE (1320)), GALGAS_bool (true) COMMA_SOURCE_FILE_AT_LINE (1316)) COMMA_SOURCE_FILE_AT_LINE (1316)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerTestCondition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_registerTestCondition.mSlotID,
                                                        categoryMethod_registerTestCondition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_registerTestCondition_buildIPICinstructionForCondition (defineCategoryMethod_registerTestCondition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@registerTestCondition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_registerTestCondition_computeInstructionCountForCondition (const cPtr_conditionExpression * inObject,
                                                                                      const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                      GALGAS_uint & outArgument_outInstructionCount,
                                                                                      C_Compiler * /* inCompiler */
                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_registerTestCondition * object = (const cPtr_registerTestCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_registerTestCondition) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = object->mAttribute_mBranchIfZero.operator_xor (constinArgument_inComplementaryBranch COMMA_SOURCE_FILE_AT_LINE (1331)).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @assignmentInstructionForGeneration
    outArgument_outInstructionCount = GALGAS_uint ((PMUInt32) 3U) ;
  }else if (kBoolFalse == test_0) {
    //-------- @assignmentInstructionForGeneration
    outArgument_outInstructionCount = GALGAS_uint ((PMUInt32) 2U) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_registerTestCondition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_registerTestCondition.mSlotID,
                                                           categoryMethod_registerTestCondition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_registerTestCondition_computeInstructionCountForCondition (defineCategoryMethod_registerTestCondition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@negateCondition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_negateCondition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                             const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                             const GALGAS_uint constinArgument_inCurrentBank,
                                                                             const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                             GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                             const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                             const GALGAS_location constinArgument_inInstructionLocation,
                                                                             const GALGAS_string constinArgument_inTargetLabel,
                                                                             GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                             GALGAS_string & ioArgument_ioListFileContents,
                                                                             C_Compiler * inCompiler
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_negateCondition * object = (const cPtr_negateCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_negateCondition) ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mCondition.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, constinArgument_inComplementaryBranch.operator_not (SOURCE_FILE_AT_LINE (1356)), constinArgument_inInstructionLocation, constinArgument_inTargetLabel, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1351)) ;
  //-------- END @methodCallInstructionForGeneration
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_negateCondition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_negateCondition.mSlotID,
                                                        categoryMethod_negateCondition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

