pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_negateCondition_buildIPICinstructionForCondition (defineCategoryMethod_negateCondition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@negateCondition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_negateCondition_computeInstructionCountForCondition (const cPtr_conditionExpression * inObject,
                                                                                const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                GALGAS_uint & outArgument_outInstructionCount,
                                                                                C_Compiler * inCompiler
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_negateCondition * object = (const cPtr_negateCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_negateCondition) ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_computeInstructionCountForCondition ((const cPtr_conditionExpression *) object->mAttribute_mCondition.ptr (), constinArgument_inComplementaryBranch.operator_not (SOURCE_FILE_AT_LINE (1371)), outArgument_outInstructionCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1370)) ;
  //-------- END @methodCallInstructionForGeneration
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_negateCondition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_negateCondition.mSlotID,
                                                           categoryMethod_negateCondition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_negateCondition_computeInstructionCountForCondition (defineCategoryMethod_negateCondition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@andCondition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_andCondition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                          const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                          const GALGAS_uint constinArgument_inCurrentBank,
                                                                          const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                          GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                          const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                          const GALGAS_location constinArgument_inInstructionLocation,
                                                                          const GALGAS_string constinArgument_inTargetLabel,
                                                                          GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                          GALGAS_string & ioArgument_ioListFileContents,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_andCondition * object = (const cPtr_andCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_andCondition) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = constinArgument_inComplementaryBranch.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mLeftExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (true), constinArgument_inInstructionLocation, constinArgument_inTargetLabel, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1390)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mRightExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (true), constinArgument_inInstructionLocation, constinArgument_inTargetLabel, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1401)) ;
    //-------- END @methodCallInstructionForGeneration
  }else if (kBoolFalse == test_0) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_label_30_ = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1413)) COMMA_SOURCE_FILE_AT_LINE (1413)) ;
    //-------- @incrementInstructionForGeneration
    ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1413)) ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mLeftExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (true), constinArgument_inInstructionLocation, var_label_30_, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1414)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mRightExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (false), constinArgument_inInstructionLocation, constinArgument_inTargetLabel, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1425)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @addAssignInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_30_, constinArgument_inInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1436)) COMMA_SOURCE_FILE_AT_LINE (1436)) COMMA_SOURCE_FILE_AT_LINE (1436)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_andCondition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_andCondition.mSlotID,
                                                        categoryMethod_andCondition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

