pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_andCondition_buildIPICinstructionForCondition (defineCategoryMethod_andCondition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@andCondition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_andCondition_computeInstructionCountForCondition (const cPtr_conditionExpression * inObject,
                                                                             const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                             GALGAS_uint & outArgument_outInstructionCount,
                                                                             C_Compiler * inCompiler
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_andCondition * object = (const cPtr_andCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_andCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_countLeft ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_computeInstructionCountForCondition ((const cPtr_conditionExpression *) object->mAttribute_mLeftExpression.ptr (), constinArgument_inComplementaryBranch, var_countLeft, inCompiler COMMA_SOURCE_FILE_AT_LINE (1447)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_countRight ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_computeInstructionCountForCondition ((const cPtr_conditionExpression *) object->mAttribute_mLeftExpression.ptr (), constinArgument_inComplementaryBranch, var_countRight, inCompiler COMMA_SOURCE_FILE_AT_LINE (1452)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @assignmentInstructionForGeneration
  outArgument_outInstructionCount = var_countLeft.add_operation (var_countRight, inCompiler COMMA_SOURCE_FILE_AT_LINE (1456)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_andCondition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_andCondition.mSlotID,
                                                           categoryMethod_andCondition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_andCondition_computeInstructionCountForCondition (defineCategoryMethod_andCondition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@bitTest_in_structured_if_condition buildIPICinstructionForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (const cPtr_conditionExpression * inObject,
                                                                                                            const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                                            const GALGAS_uint constinArgument_inCurrentBank,
                                                                                                            const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                                            GALGAS_uint & /* ioArgument_ioLocalLabelIndex */,
                                                                                                            const GALGAS_bool constinArgument_inComplementaryBranch,
                                                                                                            const GALGAS_location constinArgument_inInstructionLocation,
                                                                                                            const GALGAS_string constinArgument_inTargetLabel,
                                                                                                            GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                            GALGAS_string & /* ioArgument_ioListFileContents */,
                                                                                                            C_Compiler * inCompiler
                                                                                                            COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_bitTest_5F_in_5F_structured_5F_if_5F_condition * object = (const cPtr_bitTest_5F_in_5F_structured_5F_if_5F_condition *) inObject ;
  macroValidSharedObject (object, const cPtr_bitTest_5F_in_5F_structured_5F_if_5F_condition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bitSliceTable var_bitSliceTable ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_ipic_5F_registerExpression var_IPICregisterDescription ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_resolveAccess ((const cPtr_registerExpression *) object->mAttribute_mRegisterExpression.ptr (), constinArgument_inAccessBankSplitOffset, constinArgument_inCurrentBank, constinArgument_inRegisterTable, var_IPICregisterDescription, var_bitSliceTable, inCompiler COMMA_SOURCE_FILE_AT_LINE (1474)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_bitNumber ;
  //-------- @methodCallInstructionForGeneration
  callCategoryMethod_getBitNumber ((const cPtr_bitNumberExpression *) object->mAttribute_mBitNumber.ptr (), var_bitSliceTable, var_bitNumber, inCompiler COMMA_SOURCE_FILE_AT_LINE (1482)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_31__38__5F_instruction_5F_BitTestSkip::constructor_new (constinArgument_inInstructionLocation, object->mAttribute_mBTFSSinstruction.operator_xor (constinArgument_inComplementaryBranch COMMA_SOURCE_FILE_AT_LINE (1488)), var_IPICregisterDescription, var_bitNumber COMMA_SOURCE_FILE_AT_LINE (1486)) COMMA_SOURCE_FILE_AT_LINE (1486)) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (constinArgument_inInstructionLocation, GALGAS_lstring::constructor_new (constinArgument_inTargetLabel, constinArgument_inInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1492)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1492)) COMMA_SOURCE_FILE_AT_LINE (1492)) COMMA_SOURCE_FILE_AT_LINE (1492)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (void) {
  enterCategoryMethod_buildIPICinstructionForCondition (kTypeDescriptor_GALGAS_bitTest_5F_in_5F_structured_5F_if_5F_condition.mSlotID,
                                                        categoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition) ;
}

//---------------------------------------------------------------------------*

