pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
C_PrologueEpilogue gMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition (defineCategoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_buildIPICinstructionForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@bitTest_in_structured_if_condition computeInstructionCountForCondition'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (const cPtr_conditionExpression * /* inObject */,
                                                                                                               const GALGAS_bool /* constinArgument_inComplementaryBranch */,
                                                                                                               GALGAS_uint & outArgument_outInstructionCount,
                                                                                                               C_Compiler * /* inCompiler */
                                                                                                               COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @assignmentInstructionForGeneration
  outArgument_outInstructionCount = GALGAS_uint ((PMUInt32) 2U) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (void) {
  enterCategoryMethod_computeInstructionCountForCondition (kTypeDescriptor_GALGAS_bitTest_5F_in_5F_structured_5F_if_5F_condition.mSlotID,
                                                           categoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition (defineCategoryMethod_bitTest_5F_in_5F_structured_5F_if_5F_condition_computeInstructionCountForCondition, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_structured_if buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_instruction_5F_structured_5F_if_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                     const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                     const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                     const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                     const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                     GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                                     GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                     GALGAS_string & ioArgument_ioListFileContents,
                                                                                     GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                     const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                     GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                                     const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_structured_5F_if * object = (const cPtr_instruction_5F_structured_5F_if *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_structured_5F_if) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_generateComplementaryCondition = GALGAS_bool (false) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (gOption_piccolo_5F_options_performOptimizations.reader_value ()).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_directCount ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_computeInstructionCountForCondition ((const cPtr_conditionExpression *) object->mAttribute_mIfCondition.ptr (), GALGAS_bool (true), var_directCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1522)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_1 = GALGAS_bool (kIsStrictSup, object->mAttribute_mElseInstructionList.reader_length (SOURCE_FILE_AT_LINE (1523)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_1) {
      //-------- @incrementInstructionForGeneration
      var_directCount.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1524)) ;
    }
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_complementaryCount ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_computeInstructionCountForCondition ((const cPtr_conditionExpression *) object->mAttribute_mIfCondition.ptr (), GALGAS_bool (false), var_complementaryCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1526)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_2 = GALGAS_bool (kIsStrictSup, object->mAttribute_mThenInstructionList.reader_length (SOURCE_FILE_AT_LINE (1527)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_2) {
      //-------- @incrementInstructionForGeneration
      var_complementaryCount.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1528)) ;
    }
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_3 = GALGAS_bool (kIsStrictInf, var_complementaryCount.objectCompare (var_directCount)).boolEnum () ;
    if (kBoolTrue == test_3) {
      //-------- @assignmentInstructionForGeneration
      var_generateComplementaryCondition = GALGAS_bool (true) ;
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (ioArgument_ioGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (1532)).reader_string (SOURCE_FILE_AT_LINE (1532)) COMMA_SOURCE_FILE_AT_LINE (1532)).operator_concat (GALGAS_string (": generates complementary test (saves ") COMMA_SOURCE_FILE_AT_LINE (1532)).operator_concat (var_directCount.substract_operation (var_complementaryCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1533)).reader_string (SOURCE_FILE_AT_LINE (1533)) COMMA_SOURCE_FILE_AT_LINE (1533)).operator_concat (GALGAS_string (" instruction") COMMA_SOURCE_FILE_AT_LINE (1533)) COMMA_SOURCE_FILE_AT_LINE (1532)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_4 = GALGAS_bool (kIsStrictSup, var_directCount.substract_operation (var_complementaryCount, inCompiler COMMA_SOURCE_FILE_AT_LINE (1534)).objectCompare (GALGAS_uint ((PMUInt32) 1U))).boolEnum () ;
      if (kBoolTrue == test_4) {
        //-------- @appendInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("s") COMMA_SOURCE_FILE_AT_LINE (1535)) ;
      }
      //-------- @appendInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (")\n") COMMA_SOURCE_FILE_AT_LINE (1537)) ;
    }
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_elseBranchFinalBank = ioArgument_ioCurrentBank ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_thenBranchFinalBank = ioArgument_ioCurrentBank ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_elseContinuesInSequence ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_bool var_thenContinuesInSequence ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_5 = var_generateComplementaryCondition.boolEnum () ;
  if (kBoolTrue == test_5) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_label_5F_nextCondition = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1546)) COMMA_SOURCE_FILE_AT_LINE (1546)) ;
    //-------- @incrementInstructionForGeneration
    ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1546)) ;
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_label_5F_endOfIfinstruction = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1547)) COMMA_SOURCE_FILE_AT_LINE (1547)) ;
    //-------- @incrementInstructionForGeneration
    ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1547)) ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mIfCondition.ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (false), object->mAttribute_mInstructionLocation, var_label_5F_nextCondition, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1549)) ;
    //-------- END @methodCallInstructionForGeneration
    { //-------- @routineCallInstructionForGeneration
    routine_handleInstructionList (object->mAttribute_mElseInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_elseBranchFinalBank, constinArgument_inShouldPreserveBSR, var_elseContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1561)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_6 = GALGAS_bool (kIsStrictSup, object->mAttribute_mThenInstructionList.reader_length (SOURCE_FILE_AT_LINE (1576)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_6) {
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_lstring::constructor_new (var_label_5F_endOfIfinstruction, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1577)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1577)) COMMA_SOURCE_FILE_AT_LINE (1577)) COMMA_SOURCE_FILE_AT_LINE (1577)) ;
    }
    //-------- @addAssignInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_5F_nextCondition, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1579)) COMMA_SOURCE_FILE_AT_LINE (1579)) COMMA_SOURCE_FILE_AT_LINE (1579)) ;
    { //-------- @routineCallInstructionForGeneration
    routine_handleInstructionList (object->mAttribute_mThenInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_thenBranchFinalBank, constinArgument_inShouldPreserveBSR, var_thenContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1580)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_7 = GALGAS_bool (kIsStrictSup, object->mAttribute_mThenInstructionList.reader_length (SOURCE_FILE_AT_LINE (1594)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_7) {
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_5F_endOfIfinstruction, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1595)) COMMA_SOURCE_FILE_AT_LINE (1595)) COMMA_SOURCE_FILE_AT_LINE (1595)) ;
    }
  }else if (kBoolFalse == test_5) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_label_5F_nextCondition = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1599)) COMMA_SOURCE_FILE_AT_LINE (1599)) ;
    //-------- @incrementInstructionForGeneration
    ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1599)) ;
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_string var_label_5F_endOfIfinstruction = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1600)) COMMA_SOURCE_FILE_AT_LINE (1600)) ;
    //-------- @incrementInstructionForGeneration
    ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1600)) ;
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) object->mAttribute_mIfCondition.ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (true), object->mAttribute_mInstructionLocation, var_label_5F_nextCondition, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1602)) ;
    //-------- END @methodCallInstructionForGeneration
    { //-------- @routineCallInstructionForGeneration
    routine_handleInstructionList (object->mAttribute_mThenInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_thenBranchFinalBank, constinArgument_inShouldPreserveBSR, var_thenContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1614)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_8 = GALGAS_bool (kIsStrictSup, object->mAttribute_mElseInstructionList.reader_length (SOURCE_FILE_AT_LINE (1629)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_8) {
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_lstring::constructor_new (var_label_5F_endOfIfinstruction, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1630)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1630)) COMMA_SOURCE_FILE_AT_LINE (1630)) COMMA_SOURCE_FILE_AT_LINE (1630)) ;
    }
    //-------- @addAssignInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_5F_nextCondition, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1632)) COMMA_SOURCE_FILE_AT_LINE (1632)) COMMA_SOURCE_FILE_AT_LINE (1632)) ;
    { //-------- @routineCallInstructionForGeneration
    routine_handleInstructionList (object->mAttribute_mElseInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_elseBranchFinalBank, constinArgument_inShouldPreserveBSR, var_elseContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1633)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_9 = GALGAS_bool (kIsStrictSup, object->mAttribute_mElseInstructionList.reader_length (SOURCE_FILE_AT_LINE (1647)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_9) {
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_label_5F_endOfIfinstruction, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1648)) COMMA_SOURCE_FILE_AT_LINE (1648)) COMMA_SOURCE_FILE_AT_LINE (1648)) ;
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_10 = GALGAS_bool (kIsEqual, var_elseBranchFinalBank.objectCompare (var_thenBranchFinalBank)).boolEnum () ;
  if (kBoolTrue == test_10) {
    //-------- @assignmentInstructionForGeneration
    ioArgument_ioCurrentBank = var_elseBranchFinalBank ;
  }else if (kBoolFalse == test_10) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mEndOfElsePartLocation, GALGAS_string ("This branch does not leave BSR value as the first one does") COMMA_SOURCE_FILE_AT_LINE (1654)) ;
    //-------- @assignmentInstructionForGeneration
    var_elseBranchFinalBank = GALGAS_uint::constructor_max (SOURCE_FILE_AT_LINE (1655)) ;
  }
  //-------- @assignmentInstructionForGeneration
  ioArgument_ioContinuesInSequence = var_thenContinuesInSequence.operator_or (var_elseContinuesInSequence COMMA_SOURCE_FILE_AT_LINE (1658)) ;
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_instruction_5F_structured_5F_if_buildIPICinstructionList (void) {
  enterCategoryMethod_buildIPICinstructionList (kTypeDescriptor_GALGAS_instruction_5F_structured_5F_if.mSlotID,
                                                categoryMethod_instruction_5F_structured_5F_if_buildIPICinstructionList) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_instruction_5F_structured_5F_if_buildIPICinstructionList (defineCategoryMethod_instruction_5F_structured_5F_if_buildIPICinstructionList, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category method '@instruction_do_while buildIPICinstructionList'*
//                                                                           *
//---------------------------------------------------------------------------*

