pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_checkingAndBuildIPIC.cpp
static void categoryMethod_instruction_5F_do_5F_while_buildIPICinstructionList (const cPtr_piccolo_5F_instruction * inObject,
                                                                                const GALGAS_uint constinArgument_inAccessBankSplitOffset,
                                                                                const GALGAS_routineMap constinArgument_inRoutineMap,
                                                                                const GALGAS_registerTable constinArgument_inRegisterTable,
                                                                                const GALGAS_constantMap constinArgument_inConstantMap,
                                                                                GALGAS_uint & ioArgument_ioLocalLabelIndex,
                                                                                GALGAS_ipic_31__38__5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                GALGAS_string & ioArgument_ioListFileContents,
                                                                                GALGAS_uint & ioArgument_ioCurrentBank,
                                                                                const GALGAS_bool constinArgument_inShouldPreserveBSR,
                                                                                GALGAS_bool & ioArgument_ioContinuesInSequence,
                                                                                const GALGAS_routineKind constinArgument_inRoutineKind,
                                                                                C_Compiler * inCompiler
                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_instruction_5F_do_5F_while * object = (const cPtr_instruction_5F_do_5F_while *) inObject ;
  macroValidSharedObject (object, const cPtr_instruction_5F_do_5F_while) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_labelInstructionBegin = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1677)) COMMA_SOURCE_FILE_AT_LINE (1677)) ;
  //-------- @incrementInstructionForGeneration
  ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1677)) ;
  //-------- @addAssignInstructionForGeneration
  ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_labelInstructionBegin, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1679)) COMMA_SOURCE_FILE_AT_LINE (1679)) COMMA_SOURCE_FILE_AT_LINE (1679)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_finalBank = ioArgument_ioCurrentBank ;
  { //-------- @routineCallInstructionForGeneration
  routine_handleInstructionList (object->mAttribute_mRepeatedInstructionList, constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_finalBank, constinArgument_inShouldPreserveBSR, ioArgument_ioContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1682)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, ioArgument_ioCurrentBank.objectCompare (var_finalBank)).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @errorInstructionForGeneration
    inCompiler->emitSemanticError (object->mAttribute_mEndOfRepeatedInstructionList, GALGAS_string ("This branch does not leave BSR value unchanged") COMMA_SOURCE_FILE_AT_LINE (1697)) ;
  }
  //-------- @foreachInstructionForGeneration
  cEnumerator_partList enumerator_57302 (object->mAttribute_mWhilePartList, true) ;
  //--- simple foreach instruction
  while (enumerator_57302.hasCurrentObject ()) {
    //-------- @ifInstructionForGeneration
    const enumGalgasBool test_1 = GALGAS_bool (kIsEqual, enumerator_57302.current_mInstructionList (HERE).reader_length (SOURCE_FILE_AT_LINE (1701)).objectCompare (GALGAS_uint ((PMUInt32) 0U))).boolEnum () ;
    if (kBoolTrue == test_1) {
      //-------- @methodCallInstructionForGeneration
      callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) enumerator_57302.current_mCondition (HERE).ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (false), object->mAttribute_mInstructionLocation, var_labelInstructionBegin, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1702)) ;
      //-------- END @methodCallInstructionForGeneration
    }else if (kBoolFalse == test_1) {
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_string var_nextBranchLabel = GALGAS_string ("_label_").operator_concat (ioArgument_ioLocalLabelIndex.reader_string (SOURCE_FILE_AT_LINE (1714)) COMMA_SOURCE_FILE_AT_LINE (1714)) ;
      //-------- @incrementInstructionForGeneration
      ioArgument_ioLocalLabelIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (1714)) ;
      //-------- @methodCallInstructionForGeneration
      callCategoryMethod_buildIPICinstructionForCondition ((const cPtr_conditionExpression *) enumerator_57302.current_mCondition (HERE).ptr (), constinArgument_inAccessBankSplitOffset, ioArgument_ioCurrentBank, constinArgument_inRegisterTable, ioArgument_ioLocalLabelIndex, GALGAS_bool (true), object->mAttribute_mInstructionLocation, var_nextBranchLabel, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, inCompiler COMMA_SOURCE_FILE_AT_LINE (1715)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
      GALGAS_uint var_bank = ioArgument_ioCurrentBank ;
      { //-------- @routineCallInstructionForGeneration
      routine_handleInstructionList (enumerator_57302.current_mInstructionList (HERE), constinArgument_inAccessBankSplitOffset, constinArgument_inRoutineMap, constinArgument_inRegisterTable, constinArgument_inConstantMap, ioArgument_ioLocalLabelIndex, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_bank, constinArgument_inShouldPreserveBSR, ioArgument_ioContinuesInSequence, constinArgument_inRoutineKind, inCompiler COMMA_SOURCE_FILE_AT_LINE (1727)) ;
      } //-------- @routineCallInstructionForGeneration
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_2 = GALGAS_bool (kIsNotEqual, ioArgument_ioCurrentBank.objectCompare (var_bank)).boolEnum () ;
      if (kBoolTrue == test_2) {
        //-------- @errorInstructionForGeneration
        inCompiler->emitSemanticError (enumerator_57302.current_mEndOfPartLocation (HERE), GALGAS_string ("This branch does not leave BSR value unchanged") COMMA_SOURCE_FILE_AT_LINE (1742)) ;
      }
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_lstring::constructor_new (var_labelInstructionBegin, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1744)), GALGAS_jumpInstructionKind::constructor_ipicRelative (SOURCE_FILE_AT_LINE (1744)) COMMA_SOURCE_FILE_AT_LINE (1744)) COMMA_SOURCE_FILE_AT_LINE (1744)) ;
      //-------- @addAssignInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.addAssign_operation (GALGAS_ipic_5F_pseudo_5F_LABEL::constructor_new (GALGAS_lstring::constructor_new (var_nextBranchLabel, object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (1745)) COMMA_SOURCE_FILE_AT_LINE (1745)) COMMA_SOURCE_FILE_AT_LINE (1745)) ;
    }
    enumerator_57302.gotoNextObject () ;
  }
}
//---------------------------------------------------------------------------*

